[
    {
        "id": "log_1755151400000",
        "version": "1.4.7",
        "type": "improvement",
        "title": "เพิ่มตัวบ่งชี้การกรองข้อมูลในการ์ดเป้าหมายการขาย",
        "description": "เพิ่มการแสดงคำเตือนในการ์ดเป้าหมายการขายเมื่อมีการใช้ตัวกรองข้อมูล เพื่อให้ผู้ใช้ทราบว่ายอดขายที่แสดงเป็นข้อมูลที่ถูกกรองแล้ว ไม่ใช่ยอดขายทั้งหมด",
        "changes": [
            "เพิ่มไอคอนเตือนและข้อความ 'ข้อมูลถูกกรองแล้ว' ในการ์ดยอดขาย",
            "แสดงคำเตือนเมื่อมีการใช้ตัวกรองใดๆ (วันที่, ช่องทาง, สาขา, หมวดหมู่, ค้นหา)",
            "ใช้สีเหลือง/ส้มเพื่อเน้นการแจ้งเตือน",
            "รองรับ Dark Mode ในการแสดงผลคำเตือน"
        ],
        "technical_details": "เพิ่ม conditional rendering ใน sales-target.tsx ที่ตรวจสอบ filters object และแสดงคำเตือนเมื่อมีการใช้ตัวกรองใดๆ",
        "impact": "ผู้ใช้จะไม่เข้าใจผิดเกี่ยวกับยอดขายที่แสดงในการ์ดเป้าหมาย และทราบได้ชัดเจนว่าข้อมูลถูกกรองแล้ว",
        "date": "2025-08-14",
        "time": "13:10:00"
    },
    {
        "id": "log_1755151300000",
        "version": "1.4.6",
        "type": "improvement",
        "title": "ปรับปรุงการจัดการโหมดกำหนดเองในตัวกรองวันที่",
        "description": "ปรับปรุงลอจิกการจัดการโหมดกำหนดเองในตัวกรองช่วงวันที่ให้ทำงานได้ราบรื่นมากขึ้น โดยเพิ่มคำอธิบายที่ชัดเจนและปรับปรุงการแสดงผล date pickers เมื่อผู้ใช้เลือกโหมดกำหนดเอง",
        "changes": [
            "เพิ่มคำอธิบายที่ชัดเจนในโค้ดสำหรับการจัดการโหมดกำหนดเอง",
            "ปรับปรุงลอจิกการแสดงผล date pickers ให้เหมาะสมมากขึ้น",
            "เพิ่มการจัดการกรณีที่ผู้ใช้เปลี่ยนไปโหมดกำหนดเองโดยไม่มีวันที่เริ่มต้น"
        ],
        "technical_details": "ปรับปรุงฟังก์ชัน handleDateRangePreset ใน dashboard-filters.tsx เพิ่มคำอธิบายและปรับปรุงการจัดการ case 'custom'",
        "impact": "ผู้ใช้จะได้รับประสบการณ์ที่ดีขึ้นเมื่อใช้งานตัวกรองวันที่แบบกำหนดเอง โดยระบบจะแสดง date pickers อย่างเหมาะสม",
        "date": "2025-08-14",
        "time": "13:05:00"
    },
    {
        "id": "log_1755151200000",
        "version": "1.4.5",
        "type": "improvement",
        "title": "ปรับปรุงการจัดรูปแบบโค้ดในไฟล์ Settings Types",
        "description": "ทำความสะอาดโค้ดในไฟล์ src/types/settings.ts โดยลบช่องว่างที่ไม่จำเป็นออก ทำให้โค้ดมีความเป็นระเบียบมากขึ้น",
        "changes": [
            "ลบ trailing whitespace ออกจากไฟล์ settings.ts",
            "ปรับปรุงการจัดรูปแบบโค้ดให้สม่ำเสมอ",
            "ไม่มีการเปลี่ยนแปลงฟังก์ชันการทำงาน"
        ],
        "technical_details": "Code formatting cleanup - removed trailing whitespace from multiple lines in src/types/settings.ts",
        "impact": "ไม่มีผลกระทบต่อการใช้งาน เป็นการปรับปรุงคุณภาพโค้ดเท่านั้น",
        "date": "2025-08-14",
        "time": "13:00:00"
    },
    {
        "id": "log_1755150900000",
        "version": "1.4.4",
        "type": "improvement",
        "title": "ปรับปรุงฟิลด์สาขา/แพลตฟอร์มใน Task Reminder ให้ใช้ Dropdown",
        "description": "เปลี่ยนฟิลด์สาขา/แพลตฟอร์มใน Task Reminder จากการพิมพ์อิสระเป็น Dropdown ที่เชื่อมต่อกับการตั้งค่าระบบ ทำให้การเลือกสาขา/แพลตฟอร์มมีความสม่ำเสมอและถูกต้องมากขึ้น",
        "changes": [
            "เปลี่ยนจาก Input field เป็น Select dropdown สำหรับฟิลด์สาขา/แพลตฟอร์ม",
            "เชื่อมต่อกับการตั้งค่า branches จากระบบ Settings",
            "แสดงตัวเลือกสาขา/แพลตฟอร์มที่ผู้ใช้กำหนดไว้ในการตั้งค่า",
            "ใช้ค่าเริ่มต้น 'สาขาหลัก' หากยังไม่มีการตั้งค่า"
        ],
        "technical_details": "เปลี่ยน Input component เป็น Select component ใน TaskReminder.tsx และเชื่อมต่อกับ settings.branches จาก useSettings hook",
        "impact": "ผู้ใช้สามารถเลือกสาขา/แพลตฟอร์มได้อย่างสม่ำเสมอ ลดข้อผิดพลาดจากการพิมพ์ผิด และทำให้ข้อมูลมีความถูกต้องมากขึ้น",
        "date": "2025-08-14",
        "time": "12:55:00"
    },
    {
        "id": "log_1755150800000",
        "version": "1.4.3",
        "type": "feature",
        "title": "เพิ่มฟังก์ชันจัดการตัวเลือกในหน้าการตั้งค่า",
        "description": "เพิ่มฟังก์ชันสำหรับจัดการตัวเลือกต่างๆ ในหน้าการตั้งค่า ทำให้ผู้ใช้สามารถเพิ่ม ลบ และจัดการตัวเลือกช่องทางขาย สาขา/แพลตฟอร์ม หมวดหมู่สินค้า และหมวดหมู่รายจ่ายได้ด้วยตนเอง พร้อมเพิ่มค่าเริ่มต้นในการรีเซ็ตการตั้งค่า",
        "changes": [
            "เพิ่มฟังก์ชัน addChannel และ removeChannel สำหรับจัดการช่องทางขาย",
            "เพิ่มฟังก์ชัน addBranch และ removeBranch สำหรับจัดการสาขา/แพลตฟอร์ม",
            "เพิ่มฟังก์ชัน addProductCategory และ removeProductCategory สำหรับจัดการหมวดหมู่สินค้า",
            "เพิ่มฟังก์ชัน addExpenseCategory และ removeExpenseCategory สำหรับจัดการหมวดหมู่รายจ่าย",
            "เพิ่มค่าเริ่มต้นสำหรับตัวเลือกต่างๆ ในฟังก์ชัน handleResetSettings"
        ],
        "technical_details": "เพิ่มฟังก์ชันจัดการ state สำหรับ channels, branches, productCategories, expenseCategories ใน AppSettings.tsx และปรับปรุง handleResetSettings ให้รวมค่าเริ่มต้นของตัวเลือกต่างๆ",
        "impact": "ผู้ใช้สามารถปรับแต่งตัวเลือกในระบบได้ตามความต้องการ ทำให้ระบบมีความยืดหยุ่นมากขึ้นและสามารถใช้งานได้กับธุรกิจที่หลากหลาย",
        "date": "2025-08-14",
        "time": "12:50:00"
    },
    {
        "id": "log_1755150700000",
        "version": "1.4.2",
        "type": "improvement",
        "title": "เพิ่มฟิลด์การตั้งค่าตัวเลือกในระบบ Settings",
        "description": "เพิ่มฟิลด์ใหม่ในโครงสร้างการตั้งค่าระบบเพื่อรองรับการจัดการตัวเลือกต่างๆ ที่ใช้ในฟอร์มบันทึกข้อมูล ทำให้ผู้ใช้สามารถปรับแต่งตัวเลือกช่องทางขาย สาขา/แพลตฟอร์ม และหมวดหมู่ต่างๆ ได้ตามความต้องการ",
        "changes": [
            "เพิ่มฟิลด์ channels สำหรับจัดการตัวเลือกช่องทางขาย",
            "เพิ่มฟิลด์ branches สำหรับจัดการตัวเลือกสาขา/แพลตฟอร์ม",
            "เพิ่มฟิลด์ productCategories สำหรับจัดการหมวดหมู่สินค้า",
            "เพิ่มฟิลด์ expenseCategories สำหรับจัดการหมวดหมู่รายจ่าย"
        ],
        "technical_details": "เพิ่มฟิลด์ channels, branches, productCategories, expenseCategories ในอินเทอร์เฟซ AppSettings ใน src/types/settings.ts",
        "impact": "เตรียมพื้นฐานสำหรับการพัฒนาระบบการตั้งค่าที่ให้ผู้ใช้สามารถปรับแต่งตัวเลือกในฟอร์มได้เอง แทนที่จะใช้ค่าคงที่",
        "date": "2025-08-14",
        "time": "12:45:00"
    },
    {
        "id": "log_1755150600000",
        "version": "1.4.1",
        "type": "improvement",
        "title": "ปรับปรุงขนาดหน้าต่างเพิ่ม Task ใน Task Reminder",
        "description": "ปรับปรุงหน้าต่างเพิ่ม Task ใหม่ให้มีขนาดใหญ่ขึ้นและสามารถเลื่อนดูได้ เพื่อรองรับฟิลด์ข้อมูลที่เพิ่มขึ้นและให้ผู้ใช้สามารถกรอกข้อมูลได้สะดวกมากขึ้น",
        "changes": [
            "เปลี่ยนขนาดหน้าต่างจาก max-w-md เป็น max-w-lg",
            "เพิ่มการจำกัดความสูงสูงสุดที่ 90vh",
            "เพิ่มการเลื่อนดูแนวตั้งเมื่อเนื้อหาเกินขนาดหน้าจอ"
        ],
        "technical_details": "เปลี่ยน DialogContent className จาก 'max-w-md' เป็น 'max-w-lg max-h-[90vh] overflow-y-auto' ใน TaskReminder.tsx",
        "impact": "ผู้ใช้สามารถเห็นและกรอกข้อมูลในฟอร์มเพิ่ม Task ได้สะดวกมากขึ้น โดยเฉพาะในหน้าจอขนาดเล็กหรือเมื่อมีฟิลด์ข้อมูลจำนวนมาก",
        "date": "2025-08-14",
        "time": "12:40:00"
    },
    {
        "id": "log_1755150500000",
        "version": "1.4.0",
        "type": "feature",
        "title": "เพิ่มฟังก์ชันสำหรับแปลงข้อมูลจาก Task Reminder เป็นรายการรายรับ-รายจ่าย",
        "description": "เพิ่มฟังก์ชัน createIncomeRecord และ createExpenseRecord ใน vercel-sheets.ts เพื่อรองรับการแปลงข้อมูลจาก Task Reminder ให้เป็นรูปแบบมาตรฐานของรายการรายรับและรายจ่าย ทำให้การบันทึกข้อมูลจาก Task Reminder มีความสะดวกและแม่นยำมากขึ้น",
        "changes": [
            "เพิ่มฟังก์ชัน createIncomeRecord สำหรับแปลงข้อมูลรายรับจาก Task Reminder",
            "เพิ่มฟังก์ชัน createExpenseRecord สำหรับแปลงข้อมูลรายจ่ายจาก Task Reminder",
            "รองรับการแปลงฟิลด์ต่างๆ เช่น product_name, expense_item, channel, branch_or_platform",
            "ตั้งค่าค่าเริ่มต้นสำหรับฟิลด์ที่ไม่ได้ระบุ เช่น quantity = 1, channel = 'store'",
            "เชื่อมต่อกับฟังก์ชัน addIncomeRecord และ addExpenseRecord ที่มีอยู่แล้ว"
        ],
        "technical_details": "เพิ่มฟังก์ชัน createIncomeRecord และ createExpenseRecord ใน src/lib/vercel-sheets.ts ที่รับข้อมูลในรูปแบบ Task Reminder และแปลงเป็นรูปแบบมาตรฐานก่อนส่งไปยัง addIncomeRecord/addExpenseRecord",
        "impact": "ผู้ใช้สามารถบันทึกข้อมูลจาก Task Reminder ได้อย่างสะดวกและแม่นยำมากขึ้น โดยระบบจะจัดการการแปลงรูปแบบข้อมูลให้อัตโนมัติ",
        "date": "2025-08-14",
        "time": "12:35:00"
    },
    {
        "id": "log_1755150400000",
        "version": "1.3.9",
        "type": "improvement",
        "title": "ปรับปรุงหน้าต่างยืนยันการบันทึกใน Task Reminder",
        "description": "ปรับปรุงหน้าต่างยืนยันการบันทึกใน Task Reminder ให้รองรับทั้งรายรับและรายจ่าย พร้อมแสดงข้อมูลครบถ้วนก่อนการบันทึก ทำให้ผู้ใช้เห็นรายละเอียดที่จะถูกบันทึกอย่างชัดเจน",
        "changes": [
            "เปลี่ยนชื่อหน้าต่างจาก 'บันทึกรายจ่าย' เป็น 'บันทึกรายรับ/รายจ่าย' ตามประเภท task",
            "แสดงข้อมูลช่องทางขาย (หน้าร้าน/ออนไลน์) ในหน้าต่างยืนยัน",
            "แสดงข้อมูลสาขา/แพลตฟอร์มในหน้าต่างยืนยัน",
            "แสดงหมวดหมู่สินค้าสำหรับ task ประเภทรายรับ",
            "แสดงหมวดหมู่รายจ่ายสำหรับ task ประเภทรายจ่าย",
            "ปรับสีปุ่มยืนยันให้เหมาะสมกับประเภท (เขียวสำหรับรายรับ, ส้มสำหรับรายจ่าย)"
        ],
        "technical_details": "ปรับปรุง AlertDialog ใน TaskReminder.tsx เพิ่มการแสดงผล channel, branchOrPlatform, productCategory, expenseCategory และปรับ conditional styling สำหรับปุ่มยืนยัน",
        "impact": "ผู้ใช้สามารถตรวจสอบข้อมูลที่จะถูกบันทึกได้อย่างครบถ้วนก่อนการยืนยัน ลดความผิดพลาดในการบันทึกข้อมูล",
        "date": "2025-08-14",
        "time": "12:30:00"
    },
    {
        "id": "log_1755150100000",
        "version": "1.3.8",
        "type": "feature",
        "title": "เสร็จสิ้นการพัฒนาฟอร์ม Task Reminder แบบครบถ้วน",
        "description": "ดำเนินการเพิ่มฟิลด์ข้อมูลเพิ่มเติมในฟอร์ม Task Reminder ให้เสร็จสมบูรณ์ ตอนนี้ผู้ใช้สามารถระบุข้อมูลครบถ้วนสำหรับการสร้าง task ที่สามารถแปลงเป็นรายการรายรับ-รายจ่ายได้อย่างสมบูรณ์",
        "changes": [
            "เพิ่มฟิลด์ 'ช่องทางขาย' ให้เลือกระหว่างหน้าร้านและออนไลน์",
            "เพิ่มฟิลด์ 'สาขา/แพลตฟอร์ม' พร้อม placeholder ที่เปลี่ยนตามช่องทางที่เลือก",
            "เพิ่มฟิลด์ 'หมวดหมู่สินค้า' สำหรับ task ประเภทรายรับ",
            "เพิ่มฟิลด์ 'หมวดหมู่รายจ่าย' สำหรับ task ประเภทรายจ่าย",
            "ปรับปรุงการตรวจสอบข้อมูลให้ครอบคลุมฟิลด์ใหม่ทั้งหมด"
        ],
        "technical_details": "เพิ่ม UI components สำหรับ channel, branchOrPlatform, productCategory, และ expenseCategory ใน TaskReminder.tsx พร้อมการตรวจสอบข้อมูลแบบ conditional",
        "impact": "ผู้ใช้สามารถสร้าง Task Reminder ที่มีข้อมูลครบถ้วนและสามารถแปลงเป็นรายการรายรับ-รายจ่ายจริงได้อย่างแม่นยำ ลดขั้นตอนการกรอกข้อมูลซ้ำ",
        "date": "2025-08-14",
        "time": "12:25:00"
    },
    {
        "id": "log_1755149800000",
        "version": "1.3.7",
        "type": "improvement",
        "title": "ปรับปรุงฟอร์มข้อมูลใน Task Reminder",
        "description": "เพิ่มฟิลด์ข้อมูลเพิ่มเติมในฟอร์ม Task Reminder เพื่อรองรับการบันทึกข้อมูลที่สมบูรณ์มากขึ้น รวมถึงหมวดหมู่สินค้า หมวดหมู่ค่าใช้จ่าย ช่องทางขาย และสาขา/แพลตฟอร์ม",
        "changes": [
            "เพิ่มฟิลด์ productCategory สำหรับหมวดหมู่สินค้า",
            "เพิ่มฟิลด์ expenseCategory สำหรับหมวดหมู่ค่าใช้จ่าย", 
            "เพิ่มฟิลด์ channel สำหรับระบุช่องทางขาย (หน้าร้าน/ออนไลน์)",
            "เพิ่มฟิลด์ branchOrPlatform สำหรับระบุสาขาหรือแพลตฟอร์ม",
            "ปรับปรุงโครงสร้างข้อมูลให้สอดคล้องกับระบบบันทึกรายรับ-รายจ่าย"
        ],
        "technical_details": "เพิ่มฟิลด์ productCategory, expenseCategory, channel, branchOrPlatform ใน formData state ของ TaskReminder.tsx",
        "impact": "ผู้ใช้สามารถบันทึก Task Reminder ที่มีข้อมูลครบถ้วนมากขึ้น ทำให้การแปลงเป็นรายการรายรับ-รายจ่ายจริงมีความแม่นยำและสมบูรณ์",
        "date": "2025-08-14",
        "time": "12:20:00"
    },
    {
        "id": "log_1755149700000",
        "version": "1.3.6",
        "type": "improvement",
        "title": "ปรับปรุงตัวกรองสาขา/แพลตฟอร์มใน Dashboard",
        "description": "แก้ไขปัญหาการแสดงผลตัวเลือกสาขา/แพลตฟอร์มที่เป็นค่าว่างในระบบตัวกรอง โดยเพิ่มการกรองข้อมูลให้แสดงเฉพาะสาขาที่มีชื่อจริง",
        "changes": [
            "เพิ่มการกรองข้อมูลสาขา/แพลตฟอร์มที่เป็นค่าว่างออกจาก dropdown",
            "ปรับปรุงการแสดงผลให้แสดงเฉพาะตัวเลือกที่มีข้อมูลจริง",
            "ลดความสับสนในการเลือกตัวกรองสำหรับผู้ใช้"
        ],
        "technical_details": "เพิ่ม .filter(branch => branch && branch.trim() !== '') ใน availableBranches.map() ใน dashboard-filters.tsx",
        "impact": "ผู้ใช้จะเห็นเฉพาะตัวเลือกสาขา/แพลตฟอร์มที่มีข้อมูลจริง ทำให้การใช้งานตัวกรองมีประสิทธิภาพมากขึ้น",
        "date": "2025-08-14",
        "time": "12:15:00"
    },
    {
        "id": "log_1755149400000",
        "version": "1.3.5",
        "type": "improvement",
        "title": "ปรับปรุงโค้ดและการแสดงผลกราฟแนวโน้มรายเดือน",
        "description": "ทำความสะอาดโค้ดในคอมโพเนนต์กราฟแนวโน้มรายเดือน โดยลบ import ที่ไม่ได้ใช้งาน ปรับปรุงการจัดรูปแบบโค้ด และเพิ่มการรองรับ Dark Mode ให้ดีขึ้น",
        "changes": [
            "ลบ import Legend และ TrendingUp ที่ไม่ได้ใช้งานออก",
            "ลบ import subMonths ที่ไม่จำเป็นออก",
            "ปรับปรุงการจัดรูปแบบโค้ดให้เป็นระเบียบมากขึ้น",
            "เพิ่มการรองรับ Dark Mode ในการ์ดสรุปข้อมูล",
            "ปรับขนาดตัวอักษรในการ์ดสรุปจาก text-xl เป็น text-2xl",
            "ปรับสีและความโปร่งใสของการ์ดให้เหมาะสมกับ Dark Mode"
        ],
        "technical_details": "ลบ unused imports (Legend, TrendingUp, subMonths), ปรับปรุง CSS classes สำหรับ dark mode support, เปลี่ยน text-xl เป็น text-2xl ในการ์ดสรุป, ปรับ background opacity และ border colors",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดขนาดไฟล์ และการแสดงผลใน Dark Mode ดูสวยงามและอ่านง่ายขึ้น",
        "date": "2025-08-14",
        "time": "12:10:00"
    },
    {
        "id": "log_1755149100000",
        "version": "1.3.4",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ดหน้า Dashboard หลัก",
        "description": "ทำความสะอาดโค้ดในหน้า Dashboard หลัก โดยลบ import ที่ไม่ได้ใช้งานออก เพื่อให้โค้ดมีความเป็นระเบียบและลดขนาดไฟล์",
        "changes": [
            "ลบ import SummaryCards ที่ไม่ได้ใช้งานออกจาก Index.tsx",
            "ปรับปรุงโครงสร้าง import statements ให้เป็นระเบียบ",
            "ลดขนาดไฟล์และปรับปรุงประสิทธิภาพการโหลด"
        ],
        "technical_details": "ลบ import { SummaryCards } from '@/components/dashboard/summary-cards' ออกจาก src/pages/Index.tsx",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดขนาดไฟล์ และปรับปรุงประสิทธิภาพการโหลดหน้าเว็บ",
        "date": "2025-08-14",
        "time": "12:05:00"
    },
    {
        "id": "log_1755148800000",
        "version": "1.3.3",
        "type": "improvement",
        "title": "เตรียมปรับปรุง UI ของหน้า Task Reminder",
        "description": "เพิ่ม UI components ใหม่สำหรับปรับปรุงประสบการณ์การใช้งานในหน้า Task Reminder โดยเพิ่ม AlertDialog สำหรับการยืนยันการดำเนินการ และ DialogDescription สำหรับคำอธิบายที่ชัดเจนขึ้น",
        "changes": [
            "เพิ่ม AlertDialog components สำหรับการยืนยันการลบหรือแก้ไข task",
            "เพิ่ม DialogDescription สำหรับคำอธิบายที่ชัดเจนในฟอร์ม",
            "เพิ่ม Receipt icon สำหรับแสดงผลที่เกี่ยวข้องกับการเงิน",
            "ปรับปรุง import statements ให้รองรับ UI components ใหม่"
        ],
        "technical_details": "เพิ่ม import สำหรับ DialogDescription, AlertDialog และ components ที่เกี่ยวข้อง, เพิ่ม Receipt icon จาก lucide-react ใน src/pages/TaskReminder.tsx",
        "impact": "เตรียมพื้นฐานสำหรับการปรับปรุง UX ในการจัดการ task reminders ให้มีการยืนยันและคำอธิบายที่ชัดเจนขึ้น",
        "date": "2025-08-14",
        "time": "12:00:00"
    },
    {
        "id": "log_1755148500000",
        "version": "1.3.2",
        "type": "improvement",
        "title": "ปรับปรุง UI ของกราฟแนวโน้มรายเดือน",
        "description": "เปลี่ยนแปลงการแสดงผลของกราฟแนวโน้มรายเดือนให้ดูสวยงามและใช้งานง่ายขึ้น โดยรวมการควบคุมการแสดงผลเส้นกราฟเข้ากับการแสดงสรุปยอดรวม ทำให้ผู้ใช้สามารถดูข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว",
        "changes": [
            "เปลี่ยนปุ่มควบคุมเส้นกราฟเป็นการ์ดแบบ Interactive",
            "แสดงยอดรวมของแต่ละหมวดหมู่ในการ์ดควบคุม",
            "เพิ่ม Visual feedback เมื่อ hover และ click",
            "ปรับปรุงการจัดวางให้ดูเป็นระเบียบมากขึ้น",
            "เพิ่มสีสันและ Animation ให้ดูทันสมัย"
        ],
        "technical_details": "แทนที่ Button controls ด้วย clickable cards ที่แสดงทั้งข้อมูลสรุปและทำหน้าที่ควบคุมการแสดงผลเส้นกราฟ พร้อม responsive design และ dark mode support",
        "impact": "ผู้ใช้สามารถเห็นข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว ทำให้ประสบการณ์การใช้งานดีขึ้นและประหยัดพื้นที่หน้าจอ",
        "date": "2025-08-14",
        "time": "11:55:00"
    },
    {
        "id": "log_1755148200000",
        "version": "1.3.1",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ด Update Logs Hook",
        "description": "ปรับปรุงการจัดการ API calls ใน use-logs hook โดยย้าย API functions มาอยู่ภายในไฟล์เดียวกัน เพื่อให้โค้ดมีความเป็นระเบียบมากขึ้นและลดการ dependency",
        "changes": [
            "ย้าย API functions จาก vercel-logs.ts มาอยู่ใน use-logs.ts",
            "ลด import dependencies ที่ไม่จำเป็น",
            "ปรับปรุงโครงสร้างโค้ดให้เป็นระเบียบมากขึ้น",
            "รักษาฟังก์ชันการทำงานเดิมไว้ครบถ้วน"
        ],
        "technical_details": "Refactored use-logs.ts to include API functions locally instead of importing from vercel-logs.ts",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดความซับซ้อนในการจัดการไฟล์",
        "date": "2025-08-14",
        "time": "11:50:00"
    },
    {
        "id": "log_1755147906543",
        "version": "1.3.0",
        "type": "improvement",
        "title": "ปรับปรุงระบบตัวกรองข้อมูลใน Dashboard",
        "description": "เปลี่ยนแปลงการแสดงผลตัวกรองจากแบบ Popup เป็นแบบ Grid Layout ที่แสดงผลแบบเต็มหน้า พร้อมเพิ่มฟีเจอร์ค้นหาและแสดงสถานะตัวกรองที่ใช้งานอยู่อย่างชัดเจน ทำให้ผู้ใช้สามารถเข้าถึงและจัดการตัวกรองได้ง่ายขึ้น",
        "changes": [
            "UI Layout: เปลี่ยนจาก Popover เป็น Grid Layout แบบเต็มหน้า",
            "Search Feature: เพิ่มช่องค้นหาสำหรับชื่อสินค้าและหมายเหตุ",
            "Active Filters Display: แสดงตัวกรองที่ใช้งานอยู่พร้อมปุ่มลบแต่ละตัว",
            "Better UX: ปรับปรุงการใช้งานให้เข้าถึงได้ง่ายขึ้น",
            "Responsive Design: รองรับการแสดงผลในหน้าจอขนาดต่างๆ"
        ],
        "technical_details": "ไฟล์ที่แก้ไข: src/components/dashboard/dashboard-filters.tsx, เพิ่ม Search icon import จาก lucide-react, เปลี่ยนโครงสร้าง UI จาก Popover เป็น Grid Cards, เพิ่มฟีเจอร์ Active Filters Summary",
        "impact": "ผู้ใช้สามารถเห็นและจัดการตัวกรองได้ง่ายขึ้น, ประสบการณ์การใช้งานดีขึ้น, การค้นหาข้อมูลสะดวกมากขึ้น",
        "date": "2025-08-14",
        "time": "11:41:52"
    },
    {
        "id": "log_1755147800000",
        "version": "1.2.0",
        "type": "feature",
        "title": "เพิ่มระบบตัวกรองข้วงวันที่แบบครอบคลุม",
        "description": "เพิ่มตัวเลือกช่วงวันที่ที่หลากหลาย รวมถึง 7 วัน, 30 วัน, เดือนที่แล้ว, ปีที่แล้ว, ปีนี้, ทั้งหมด และกำหนดเอง พร้อมปฏิทินสำหรับเลือกวันที่",
        "changes": [
            "เพิ่มตัวเลือกช่วงวันที่ 7 วันที่ผ่านมา",
            "เพิ่มตัวเลือกช่วงวันที่ 30 วันที่ผ่านมา",
            "เพิ่มตัวเลือกเดือนที่แล้ว",
            "เพิ่มตัวเลือกปีที่แล้ว",
            "เพิ่มตัวเลือกปีนี้",
            "เพิ่มตัวเลือกทั้งหมด",
            "เพิ่มตัวเลือกกำหนดเองพร้อมปฏิทิน"
        ],
        "technical_details": "ปรับปรุง dashboard-filters.tsx เพิ่มฟังก์ชัน getDateRangePreset และ handleDateRangePreset",
        "impact": "ผู้ใช้สามารถกรองข้อมูลตามช่วงเวลาได้อย่างยืดหยุ่นมากขึ้น",
        "date": "2025-08-14",
        "time": "10:30:00"
    }
]