[
    {
        "id": "log_1755148500000",
        "version": "1.3.2",
        "type": "improvement",
        "title": "ปรับปรุง UI ของกราฟแนวโน้มรายเดือน",
        "description": "เปลี่ยนแปลงการแสดงผลของกราฟแนวโน้มรายเดือนให้ดูสวยงามและใช้งานง่ายขึ้น โดยรวมการควบคุมการแสดงผลเส้นกราฟเข้ากับการแสดงสรุปยอดรวม ทำให้ผู้ใช้สามารถดูข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว",
        "changes": [
            "เปลี่ยนปุ่มควบคุมเส้นกราฟเป็นการ์ดแบบ Interactive",
            "แสดงยอดรวมของแต่ละหมวดหมู่ในการ์ดควบคุม",
            "เพิ่ม Visual feedback เมื่อ hover และ click",
            "ปรับปรุงการจัดวางให้ดูเป็นระเบียบมากขึ้น",
            "เพิ่มสีสันและ Animation ให้ดูทันสมัย"
        ],
        "technical_details": "แทนที่ Button controls ด้วย clickable cards ที่แสดงทั้งข้อมูลสรุปและทำหน้าที่ควบคุมการแสดงผลเส้นกราฟ พร้อม responsive design และ dark mode support",
        "impact": "ผู้ใช้สามารถเห็นข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว ทำให้ประสบการณ์การใช้งานดีขึ้นและประหยัดพื้นที่หน้าจอ",
        "date": "2025-08-14",
        "time": "11:55:00"
    },
    {
        "id": "log_1755148200000",
        "version": "1.3.1",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ด Update Logs Hook",
        "description": "ปรับปรุงการจัดการ API calls ใน use-logs hook โดยย้าย API functions มาอยู่ภายในไฟล์เดียวกัน เพื่อให้โค้ดมีความเป็นระเบียบมากขึ้นและลดการ dependency",
        "changes": [
            "ย้าย API functions จาก vercel-logs.ts มาอยู่ใน use-logs.ts",
            "ลด import dependencies ที่ไม่จำเป็น",
            "ปรับปรุงโครงสร้างโค้ดให้เป็นระเบียบมากขึ้น",
            "รักษาฟังก์ชันการทำงานเดิมไว้ครบถ้วน"
        ],
        "technical_details": "Refactored use-logs.ts to include API functions locally instead of importing from vercel-logs.ts",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดความซับซ้อนในการจัดการไฟล์",
        "date": "2025-08-14",
        "time": "11:50:00"
    },
    {
        "id": "log_1755147906543",
        "version": "1.3.0",
        "type": "improvement",
        "title": "ปรับปรุงระบบตัวกรองข้อมูลใน Dashboard",
        "description": "เปลี่ยนแปลงการแสดงผลตัวกรองจากแบบ Popup เป็นแบบ Grid Layout ที่แสดงผลแบบเต็มหน้า พร้อมเพิ่มฟีเจอร์ค้นหาและแสดงสถานะตัวกรองที่ใช้งานอยู่อย่างชัดเจน ทำให้ผู้ใช้สามารถเข้าถึงและจัดการตัวกรองได้ง่ายขึ้น",
        "changes": [
            "UI Layout: เปลี่ยนจาก Popover เป็น Grid Layout แบบเต็มหน้า",
            "Search Feature: เพิ่มช่องค้นหาสำหรับชื่อสินค้าและหมายเหตุ",
            "Active Filters Display: แสดงตัวกรองที่ใช้งานอยู่พร้อมปุ่มลบแต่ละตัว",
            "Better UX: ปรับปรุงการใช้งานให้เข้าถึงได้ง่ายขึ้น",
            "Responsive Design: รองรับการแสดงผลในหน้าจอขนาดต่างๆ"
        ],
        "technical_details": "ไฟล์ที่แก้ไข: src/components/dashboard/dashboard-filters.tsx, เพิ่ม Search icon import จาก lucide-react, เปลี่ยนโครงสร้าง UI จาก Popover เป็น Grid Cards, เพิ่มฟีเจอร์ Active Filters Summary",
        "impact": "ผู้ใช้สามารถเห็นและจัดการตัวกรองได้ง่ายขึ้น, ประสบการณ์การใช้งานดีขึ้น, การค้นหาข้อมูลสะดวกมากขึ้น",
        "date": "2025-08-14",
        "time": "11:41:52"
    },
    {
        "id": "log_1755147800000",
        "version": "1.2.0",
        "type": "feature",
        "title": "เพิ่มระบบตัวกรองข้วงวันที่แบบครอบคลุม",
        "description": "เพิ่มตัวเลือกช่วงวันที่ที่หลากหลาย รวมถึง 7 วัน, 30 วัน, เดือนที่แล้ว, ปีที่แล้ว, ปีนี้, ทั้งหมด และกำหนดเอง พร้อมปฏิทินสำหรับเลือกวันที่",
        "changes": [
            "เพิ่มตัวเลือกช่วงวันที่ 7 วันที่ผ่านมา",
            "เพิ่มตัวเลือกช่วงวันที่ 30 วันที่ผ่านมา",
            "เพิ่มตัวเลือกเดือนที่แล้ว",
            "เพิ่มตัวเลือกปีที่แล้ว",
            "เพิ่มตัวเลือกปีนี้",
            "เพิ่มตัวเลือกทั้งหมด",
            "เพิ่มตัวเลือกกำหนดเองพร้อมปฏิทิน"
        ],
        "technical_details": "ปรับปรุง dashboard-filters.tsx เพิ่มฟังก์ชัน getDateRangePreset และ handleDateRangePreset",
        "impact": "ผู้ใช้สามารถกรองข้อมูลตามช่วงเวลาได้อย่างยืดหยุ่นมากขึ้น",
        "date": "2025-08-14",
        "time": "10:30:00"
    }
]