[
    {
        "id": "log_1755155300000",
        "version": "1.8.2",
        "type": "improvement",
        "title": "ลบปุ่มรีเซ็ตการตั้งค่าออกจากหน้าการตั้งค่า",
        "description": "ลบปุ่ม 'รีเซ็ต' ออกจากหน้าการตั้งค่าเพื่อป้องกันการรีเซ็ตการตั้งค่าโดยไม่ตั้งใจ ผู้ใช้ยังคงสามารถแก้ไขการตั้งค่าแต่ละรายการได้ตามปกติ แต่จะไม่มีปุ่มรีเซ็ตทั้งหมดกลับเป็นค่าเริ่มต้น",
        "changes": [
            "ลบปุ่ม 'รีเซ็ต' ออกจากส่วนหัวของหน้าการตั้งค่า",
            "ลบฟังก์ชัน handleResetSettings ที่เกี่ยวข้อง",
            "ปรับปรุงการจัดวางปุ่มในส่วนหัวให้เหลือเฉพาะปุ่ม 'บันทึกการตั้งค่า'"
        ],
        "technical_details": "ลบ Button component สำหรับ reset functionality และ handleResetSettings function call ออกจาก AppSettings.tsx",
        "impact": "ผู้ใช้จะปลอดภัยจากการรีเซ็ตการตั้งค่าโดยไม่ตั้งใจ การตั้งค่าจะคงอยู่และสามารถแก้ไขได้ทีละรายการ ทำให้การใช้งานมีความปลอดภัยมากขึ้น",
        "date": "2025-08-15",
        "time": "15:25:00"
    },
    {
        "id": "log_1755155200000",
        "version": "1.8.1",
        "type": "bugfix",
        "title": "แก้ไขโครงสร้าง JSX ในฟอร์มบันทึกรายรับ-รายจ่าย",
        "description": "แก้ไขปัญหาโครงสร้าง JSX ที่ไม่สมบูรณ์ในฟอร์มบันทึกรายรับ-รายจ่าย โดยเพิ่ม closing tags ที่ขาดหายไป ทำให้ฟอร์มแสดงผลและทำงานได้ถูกต้อง",
        "changes": [
            "เพิ่ม closing JSX tags ที่ขาดหายไปในส่วนท้ายของฟอร์ม",
            "แก้ไขโครงสร้าง component ให้สมบูรณ์",
            "ปรับปรุงการจัดรูปแบบโค้ดให้เป็นระเบียบ"
        ],
        "technical_details": "เพิ่ม closing tags สำหรับ Button, form, TabsContent, Tabs, CardContent, และ Card components ใน add-record-form.tsx",
        "impact": "ฟอร์มบันทึกรายรับ-รายจ่ายจะแสดงผลและทำงานได้ถูกต้อง ไม่มีปัญหาเรื่องโครงสร้าง JSX ที่ไม่สมบูรณ์",
        "date": "2025-08-15",
        "time": "15:20:00"
    },
    {
        "id": "log_1755155100000",
        "version": "1.8.0",
        "type": "improvement",
        "title": "เชื่อมต่อฟอร์มบันทึกรายรับ-รายจ่ายกับระบบการตั้งค่า",
        "description": "ปรับปรุงฟอร์มบันทึกรายรับ-รายจ่ายให้ใช้ข้อมูลสาขา/แพลตฟอร์มจากระบบการตั้งค่าแทนการใช้ค่าคงที่ ทำให้ผู้ใช้สามารถปรับแต่งรายการสาขา/แพลตฟอร์มได้ตามต้องการผ่านหน้าการตั้งค่า",
        "changes": [
            "เปลี่ยนจากรายการสาขา/แพลตฟอร์มแบบคงที่ เป็นการดึงข้อมูลจากการตั้งค่าระบบ",
            "ใช้ settings.branches แทนการแยกสาขาและแพลตฟอร์มแบบเดิม",
            "ปรับ placeholder text ให้เป็น 'เลือกสาขา/แพลตฟอร์ม' แทนการแยกตามช่องทาง",
            "รองรับการเพิ่ม/ลบสาขา/แพลตฟอร์มผ่านหน้าการตั้งค่า"
        ],
        "technical_details": "แทนที่ conditional rendering ของ SelectItem ด้วย map function ที่ดึงข้อมูลจาก settings.branches array พร้อมใช้ค่าเริ่มต้น ['สาขาหลัก'] หากยังไม่มีการตั้งค่า",
        "impact": "ผู้ใช้สามารถปรับแต่งรายการสาขา/แพลตฟอร์มได้ตามความต้องการ ไม่ต้องแก้ไขโค้ด ทำให้ระบบมีความยืดหยุ่นมากขึ้นและเหมาะสมกับธุรกิจที่มีหลายสาขาหรือใช้หลายแพลตฟอร์ม",
        "date": "2025-08-15",
        "time": "15:15:00"
    },
    {
        "id": "log_1755155000000",
        "version": "1.7.9",
        "type": "improvement",
        "title": "เตรียมการเชื่อมต่อระบบการตั้งค่ากับฟอร์มบันทึกรายรับ-รายจ่าย",
        "description": "เพิ่มการเชื่อมต่อ useSettings hook ในฟอร์มบันทึกรายรับ-รายจ่าย เพื่อเตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในฟอร์ม เช่น การใช้ตัวเลือกสาขา/แพลตฟอร์ม หมวดหมู่สินค้า และหมวดหมู่รายจ่ายจากการตั้งค่าระบบ",
        "changes": [
            "เพิ่ม import useSettings hook ในฟอร์มบันทึกรายรับ-รายจ่าย",
            "เตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในฟอร์ม",
            "รองรับการปรับแต่งตัวเลือกในฟอร์มตามการตั้งค่าของผู้ใช้"
        ],
        "technical_details": "เพิ่ม import { useSettings } from '@/hooks/use-settings' ใน src/components/forms/add-record-form.tsx",
        "impact": "เตรียมพื้นฐานสำหรับฟีเจอร์การปรับแต่งฟอร์มบันทึกรายรับ-รายจ่ายตามการตั้งค่าของผู้ใช้ เช่น การใช้รายการสาขา/แพลตฟอร์ม หมวดหมู่สินค้า และหมวดหมู่รายจ่ายจากการตั้งค่าระบบ",
        "date": "2025-08-15",
        "time": "15:10:00"
    },
    {
        "id": "log_1755154900000",
        "version": "1.7.8",
        "type": "improvement",
        "title": "ปรับปรุงการเลือกสาขา/แพลตฟอร์มในฟอร์มจัดการค่าคอมมิชชั่นพนักงาน",
        "description": "เปลี่ยนจากการพิมพ์ชื่อสาขา/แพลตฟอร์มแบบอิสระเป็นการเลือกจาก dropdown ที่ดึงข้อมูลจากการตั้งค่าระบบ ทำให้การกรอกข้อมูลมีความสม่ำเสมอและลดข้อผิดพลาดจากการพิมพ์ผิด",
        "changes": [
            "เปลี่ยนจาก Input field เป็น Select dropdown สำหรับเลือกสาขา/แพลตฟอร์ม",
            "ดึงรายการสาขา/แพลตฟอร์มจากการตั้งค่าระบบ (settings.branches)",
            "ป้องกันการพิมพ์ผิดและทำให้ข้อมูลมีความสม่ำเสมอ",
            "ใช้ค่าเริ่มต้น 'สาขาหลัก' หากยังไม่มีการตั้งค่าสาขา"
        ],
        "technical_details": "แทนที่ Input component ด้วย Select, SelectTrigger, SelectValue, SelectContent, และ SelectItem ใน section การตั้งค่าค่าคอมมิชชั่นตามสาขา/แพลตฟอร์ม",
        "impact": "ผู้ใช้สามารถเลือกสาขา/แพลตฟอร์มจาก dropdown ที่มีตัวเลือกที่สอดคล้องกับการตั้งค่าระบบ ทำให้ข้อมูลมีความถูกต้องและสม่ำเสมอมากขึ้น ลดข้อผิดพลาดจากการพิมพ์ผิด",
        "date": "2025-08-15",
        "time": "15:08:20"
    },
    {
        "id": "log_1755154800000",
        "version": "1.7.7",
        "type": "improvement",
        "title": "เตรียมการเชื่อมต่อระบบการตั้งค่ากับหน้าจัดการพนักงาน",
        "description": "เพิ่มการเชื่อมต่อ useSettings hook ในหน้าจัดการพนักงาน เพื่อเตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในการจัดการพนักงาน เช่น การใช้ตัวเลือกสาขา/แพลตฟอร์มจากการตั้งค่า หรือการปรับแต่งการแสดงผลตามการตั้งค่าของผู้ใช้",
        "changes": [
            "เพิ่ม import useSettings hook ในหน้าจัดการพนักงาน",
            "เตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในอนาคต",
            "รองรับการปรับแต่งการแสดงผลและฟีเจอร์ตามการตั้งค่าของผู้ใช้"
        ],
        "technical_details": "เพิ่ม import { useSettings } from '@/hooks/use-settings' ใน src/pages/EmployeeManagement.tsx",
        "impact": "เตรียมพื้นฐานสำหรับฟีเจอร์การปรับแต่งหน้าจัดการพนักงานตามการตั้งค่าของผู้ใช้ เช่น การใช้รายการสาขา/แพลตฟอร์มจากการตั้งค่าในฟอร์มเพิ่มพนักงาน",
        "date": "2025-08-15",
        "time": "15:06:40"
    },
    {
        "id": "log_1755154700000",
        "version": "1.7.6",
        "type": "improvement",
        "title": "อัพเดทข้อมูลตัวอย่างพนักงานให้ใช้ระบบคอมมิชชั่นใหม่",
        "description": "ปรับปรุงข้อมูลตัวอย่างพนักงานในหน้าจัดการพนักงานให้ใช้ระบบคอมมิชชั่นแบบยืดหยุ่นใหม่ที่สามารถกำหนดค่าคอมมิชชั่นแยกตามสาขา/แพลตฟอร์มได้ แทนการแบ่งแค่หน้าร้านและออนไลน์",
        "changes": [
            "อัพเดทข้อมูลตัวอย่างพนักงาน 'สมหญิง ใจดี' ให้มีคอมมิชชั่น สาขาหลัก 2.5% และ Shopee 3.0%",
            "อัพเดทข้อมูลตัวอย่างพนักงาน 'สมชาย รักงาน' ให้มีคอมมิชชั่น สาขาหลัก 3.0%, Lazada 4.0%, และ Facebook 3.5%",
            "เปลี่ยนจากโครงสร้าง storeCommission/onlineCommission เป็น branchCommissions array",
            "แสดงตัวอย่างการใช้งานระบบคอมมิชชั่นที่ซับซ้อนและยืดหยุ่นมากขึ้น"
        ],
        "technical_details": "แก้ไข mockEmployees array ใน EmployeeManagement.tsx โดยเปลี่ยนจาก storeCommission และ onlineCommission fields เป็น branchCommissions array ที่มี objects ประกอบด้วย branchOrPlatform และ commissionRate",
        "impact": "ผู้ใช้จะเห็นตัวอย่างการใช้งานระบบคอมมิชชั่นใหม่ที่ยืดหยุ่นมากขึ้น ทำให้เข้าใจวิธีการตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขา/แพลตฟอร์มได้ดีขึ้น",
        "date": "2025-08-15",
        "time": "15:05:00"
    },
    {
        "id": "log_1755154600000",
        "version": "1.7.5",
        "type": "bugfix",
        "title": "แก้ไขการแสดงผลข้อมูลคอมมิชชั่นพนักงานให้เสถียรมากขึ้น",
        "description": "ปรับปรุงการตรวจสอบและแสดงผลข้อมูลค่าคอมมิชชั่นของพนักงานให้มีความเสถียรมากขึ้น โดยเพิ่มการตรวจสอบประเภทข้อมูลและจัดการกรณีที่ข้อมูลเป็น null หรือ undefined",
        "changes": [
            "เพิ่มการตรวจสอบ Array.isArray() ก่อนแสดงผลรายการคอมมิชชั่น",
            "เพิ่ม fallback values สำหรับชื่อสาขา/แพลตฟอร์ม (แสดง 'ไม่ระบุ' หากไม่มีข้อมูล)",
            "เพิ่ม fallback values สำหรับอัตราคอมมิชชั่น (แสดง 0% หากไม่มีข้อมูล)",
            "ป้องกัน runtime errors จากข้อมูลที่ไม่สมบูรณ์"
        ],
        "technical_details": "แก้ไขการตรวจสอบ employee.branchCommissions ให้ใช้ Array.isArray() และเพิ่ม null checks สำหรับ commission.branchOrPlatform และ commission.commissionRate ใน EmployeeManagement.tsx",
        "impact": "การแสดงผลข้อมูลพนักงานจะเสถียรมากขึ้น ไม่เกิด errors หรือการแสดงผลที่ผิดปกติเมื่อข้อมูลคอมมิชชั่นไม่สมบูรณ์ ผู้ใช้จะเห็นข้อความ 'ไม่ระบุ' และ '0%' แทนค่าว่างหรือ undefined",
        "date": "2025-08-15",
        "time": "15:00:00"
    },
    {
        "id": "log_1755154500000",
        "version": "1.7.4",
        "type": "improvement",
        "title": "อัพเดทระบบ Backend สำหรับรองรับค่าคอมมิชชั่นแบบยืดหยุ่น",
        "description": "ปรับปรุงระบบ Backend API และการประมวลผลข้อมูลพนักงานให้รองรับระบบคอมมิชชั่นแบบใหม่ที่สามารถกำหนดค่าคอมมิชชั่นแยกตามสาขา/แพลตฟอร์มได้ แทนการแบ่งแค่หน้าร้านและออนไลน์",
        "changes": [
            "อัพเดทฟังก์ชัน parseEmployeeData ให้อ่านข้อมูล branchCommissions จาก JSON",
            "เปลี่ยนจากการอ่าน storeCommission และ onlineCommission แยกกัน เป็นการอ่าน branchCommissions array",
            "เพิ่มการจัดการ error handling สำหรับการ parse JSON ของ commission data",
            "อัพเดท API functions ให้ส่งและรับข้อมูล branchCommissions แทน commission แยกกัน"
        ],
        "technical_details": "แก้ไข parseEmployeeData function ใน vercel-employees.ts โดยเปลี่ยนจากการ parse row[8] และ row[9] เป็น storeCommission/onlineCommission เป็นการ parse row[8] เป็น JSON array ของ branchCommissions พร้อมเพิ่ม try-catch สำหรับ error handling",
        "impact": "ระบบ Backend สามารถรองรับการจัดเก็บและประมวลผลข้อมูลคอมมิชชั่นแบบยืดหยุ่นได้ ทำให้ข้อมูลคอมมิชชั่นที่ซับซ้อนสามารถจัดเก็บและแสดงผลได้อย่างถูกต้อง",
        "date": "2025-08-15",
        "time": "14:55:00"
    },
    {
        "id": "log_1755154400000",
        "version": "1.7.3",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลค่าคอมมิชชั่นในหน้าจัดการพนักงาน",
        "description": "ปรับปรุงการแสดงผลข้อมูลค่าคอมมิชชั่นในหน้าจัดการพนักงานให้แสดงรายละเอียดตามสาขา/แพลตฟอร์มแทนการแสดงแบบแยกหน้าร้าน-ออนไลน์ ทำให้ผู้ใช้เห็นข้อมูลคอมมิชชั่นที่ละเอียดและครบถ้วนมากขึ้น",
        "changes": [
            "เปลี่ยนจากการแสดงคอมมิชชั่น 2 การ์ดแยก (หน้าร้าน/ออนไลน์) เป็นการ์ดเดียวที่แสดงทุกสาขา/แพลตฟอร์ม",
            "แสดงจำนวนสาขา/แพลตฟอร์มที่ตั้งค่าคอมมิชชั่นไว้",
            "แสดงรายละเอียดคอมมิชชั่นแต่ละสาขา/แพลตฟอร์มในรูปแบบ grid",
            "เพิ่มข้อความแจ้งเตือนเมื่อยังไม่มีการตั้งค่าคอมมิชชั่น",
            "ปรับ layout จาก grid 3 คอลัมน์ เป็น vertical stack เพื่อรองรับข้อมูลที่เพิ่มขึ้น"
        ],
        "technical_details": "แก้ไขการแสดงผล commission section ใน EmployeeManagement.tsx โดยเปลี่ยนจาก grid layout เป็น vertical layout และใช้ branchCommissions array แทน storeCommission/onlineCommission fields",
        "impact": "ผู้ใช้สามารถเห็นข้อมูลคอมมิชชั่นที่ละเอียดและครบถ้วนมากขึ้น รวมถึงสามารถดูอัตราคอมมิชชั่นของแต่ละสาขา/แพลตฟอร์มได้อย่างชัดเจน ทำให้การจัดการและตรวจสอบข้อมูลพนักงานมีประสิทธิภาพมากขึ้น",
        "date": "2025-08-15",
        "time": "14:50:00"
    },
    {
        "id": "log_1755154300000",
        "version": "1.7.2",
        "type": "feature",
        "title": "เพิ่มระบบจัดการค่าคอมมิชชั่นแบบยืดหยุ่นในฟอร์มพนักงาน",
        "description": "ปรับปรุงฟอร์มเพิ่ม/แก้ไขพนักงานให้รองรับการตั้งค่าคอมมิชชั่นแยกตามสาขาและแพลตฟอร์มได้อย่างละเอียด แทนที่จะแบ่งแค่หน้าร้านและออนไลน์ ผู้ใช้สามารถเพิ่ม ลบ และกำหนดอัตราคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขา/แพลตฟอร์มได้",
        "changes": [
            "เปลี่ยนจากฟิลด์คอมมิชชั่นแบบคงที่ 2 ช่อง เป็นระบบแบบไดนามิก",
            "เพิ่มปุ่ม 'เพิ่มสาขา' สำหรับเพิ่มการตั้งค่าคอมมิชชั่นใหม่",
            "รองรับการลบการตั้งค่าคอมมิชชั่นที่ไม่ต้องการ",
            "แสดงข้อความแนะนำเมื่อยังไม่มีการตั้งค่าคอมมิชชั่น",
            "เพิ่มการเลื่อนดูเมื่อมีการตั้งค่าคอมมิชชั่นจำนวนมาก"
        ],
        "technical_details": "แทนที่ storeCommission และ onlineCommission fields ด้วย branchCommissions array ที่รองรับ dynamic commission settings พร้อม UI สำหรับจัดการ",
        "impact": "ผู้ใช้สามารถตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขาหรือแพลตฟอร์มได้ เช่น Lotus Yala 2%, ตลาดใหม่ 2.5%, TikTok 3%, Facebook 3.5% ทำให้การจัดการค่าคอมมิชชั่นมีความยืดหยุ่นและแม่นยำมากขึ้น",
        "date": "2025-08-15",
        "time": "14:45:00"
    },
    {
        "id": "log_1755154200000",
        "version": "1.7.1",
        "type": "improvement",
        "title": "อัพเดทฟอร์มจัดการพนักงานให้รองรับระบบคอมมิชชั่นใหม่",
        "description": "ปรับปรุงฟอร์มเพิ่ม/แก้ไขพนักงานให้ใช้ระบบคอมมิชชั่นแบบยืดหยุ่นใหม่ที่สามารถกำหนดค่าคอมมิชชั่นแยกตามสาขาและแพลตฟอร์มได้ แทนการแบ่งแค่หน้าร้านและออนไลน์",
        "changes": [
            "เปลี่ยนจากฟิลด์ storeCommission และ onlineCommission เป็น branchCommissions",
            "รองรับการตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขา/แพลตฟอร์ม",
            "ปรับปรุงการส่งข้อมูลในฟอร์มให้สอดคล้องกับโครงสร้างใหม่",
            "เตรียมพื้นฐานสำหรับ UI ที่ให้ผู้ใช้จัดการคอมมิชชั่นแต่ละสาขาได้"
        ],
        "technical_details": "แก้ไข employeeData object ใน handleSubmit function ของ EmployeeManagement.tsx โดยเปลี่ยนจาก storeCommission, onlineCommission เป็น branchCommissions array",
        "impact": "เตรียมพื้นฐานสำหรับระบบคอมมิชชั่นที่ยืดหยุ่นมากขึ้น ผู้ใช้จะสามารถตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขาหรือแพลตฟอร์มได้ในอนาคต",
        "date": "2025-08-15",
        "time": "14:43:20"
    },
    {
        "id": "log_1755154100000",
        "version": "1.7.0",
        "type": "improvement",
        "title": "ปรับปรุงระบบค่าคอมมิชชั่นพนักงานให้ยืดหยุ่นมากขึ้น",
        "description": "เปลี่ยนระบบค่าคอมมิชชั่นพนักงานจากการแบ่งแค่ 'หน้าร้าน' และ 'ออนไลน์' เป็นระบบที่สามารถกำหนดค่าคอมมิชชั่นแยกตามสาขาหรือแพลตฟอร์มได้อย่างละเอียด ทำให้สามารถตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขา/แพลตฟอร์มได้",
        "changes": [
            "เพิ่ม interface BranchCommission สำหรับจัดการค่าคอมมิชชั่นตามสาขา/แพลตฟอร์ม",
            "เปลี่ยนจาก storeCommission และ onlineCommission เป็น branchCommissions array",
            "รองรับการตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขา/แพลตฟอร์ม",
            "เตรียมพื้นฐานสำหรับระบบคำนวณค่าคอมมิชชั่นที่ซับซ้อนมากขึ้น"
        ],
        "technical_details": "แก้ไข Employee interface ใน src/types/employee.ts โดยเพิ่ม BranchCommission interface และเปลี่ยน commission fields จาก storeCommission, onlineCommission เป็น branchCommissions array",
        "impact": "ผู้ใช้จะสามารถตั้งค่าคอมมิชชั่นที่แตกต่างกันสำหรับแต่ละสาขาหรือแพลตฟอร์มได้ เช่น Lotus Yala 2%, ตลาดใหม่ 2.5%, TikTok 3%, Facebook 3.5% ทำให้การจัดการค่าคอมมิชชั่นมีความยืดหยุ่นและแม่นยำมากขึ้น",
        "date": "2025-08-15",
        "time": "14:41:40"
    },
    {
        "id": "log_1755154000000",
        "version": "1.6.5",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลหน้าจัดการพนักงานให้สวยงามและใช้งานง่ายขึ้น",
        "description": "ปรับปรุงการออกแบบและการแสดงผลของหน้าจัดการพนักงานให้มีความทันสมัยและใช้งานง่ายมากขึ้น พร้อมเพิ่มการแสดงผลข้อมูลที่สำคัญอย่างเด่นชัด",
        "changes": [
            "ปรับปรุงการ์ดพนักงานให้มี gradient background และ shadow effects ที่สวยงาม",
            "เพิ่มอวตารพนักงานขนาดใหญ่ขึ้น (16x16) พร้อม gradient สีที่สวยงาม",
            "เพิ่มตัวบ่งชี้สถานะการทำงาน (จุดเขียว) บนอวตาร",
            "แยกการแสดงผลเงินเดือนและค่าคอมมิชชั่นเป็นการ์ดย่อยที่มีสีสันและไอคอน",
            "ปรับปรุงการแสดงผลข้อมูลติดต่อให้มี background และ spacing ที่ดีขึ้น",
            "เพิ่มการแสดงผลหมายเหตุแบบพิเศษด้วยสีเหลือง/ส้มเพื่อเน้นความสำคัญ",
            "ปรับปรุงปุ่มแก้ไขและลบให้มี hover effects ที่ชัดเจน",
            "เพิ่ม responsive design ที่ดีขึ้นสำหรับหน้าจอขนาดต่างๆ"
        ],
        "technical_details": "ปรับปรุง UI components ใน src/pages/EmployeeManagement.tsx โดยเพิ่ม gradient backgrounds, shadow effects, และ responsive grid layouts สำหรับการแสดงผลข้อมูลเงินเดือนและค่าคอมมิชชั่น",
        "impact": "ผู้ใช้จะได้รับประสบการณ์การใช้งานที่ดีขึ้นในการดูและจัดการข้อมูลพนักงาน ข้อมูลสำคัญจะเด่นชัดและอ่านง่ายมากขึ้น",
        "date": "2025-08-15",
        "time": "14:40:00"
    },
    {
        "id": "log_1755153700000",
        "version": "1.6.4",
        "type": "improvement",
        "title": "ปรับปรุงการประมวลผลข้อมูลพนักงานและเพิ่ม Debug Logging",
        "description": "ปรับปรุงฟังก์ชันการประมวลผลข้อมูลพนักงานจาก Google Sheets ให้มีความชัดเจนและเพิ่มการบันทึก debug logs เพื่อช่วยในการตรวจสอบและแก้ไขปัญหาการอ่านข้อมูล",
        "changes": [
            "ปรับโครงสร้างโค้ดใน parseEmployeeData function ให้อ่านง่ายขึ้น",
            "เพิ่ม debug logging เพื่อแสดงข้อมูลแต่ละแถวที่กำลังประมวลผล",
            "เพิ่มคำอธิบายในโค้ดเกี่ยวกับการแปลงข้อมูลเงินเดือนเป็นตัวเลข",
            "ปรับปรุงการจัดรูปแบบโค้ดให้เป็นระเบียบมากขึ้น"
        ],
        "technical_details": "แก้ไข parseEmployeeData function ใน src/lib/vercel-employees.ts โดยเปลี่ยนจาก arrow function เป็น block function และเพิ่ม console.log สำหรับ debugging",
        "impact": "ช่วยให้นักพัฒนาสามารถตรวจสอบและแก้ไขปัญหาการอ่านข้อมูลพนักงานได้ง่ายขึ้น โดยไม่มีผลกระทบต่อการใช้งานของผู้ใช้",
        "date": "2025-08-15",
        "time": "14:35:00"
    },
    {
        "id": "log_1755153600000",
        "version": "1.6.3",
        "type": "bugfix",
        "title": "แก้ไขการ import formatDate ใน Task Reminder",
        "description": "แก้ไขปัญหาการ import ฟังก์ชัน formatDate ที่ขาดหายไปในหน้า Task Reminder ทำให้การแสดงผลวันที่ทำงานได้ถูกต้อง",
        "changes": [
            "เพิ่ม import { formatDate } from '@/lib/utils' ในไฟล์ TaskReminder.tsx",
            "แก้ไขปัญหาการแสดงผลวันที่ที่อาจเกิดข้อผิดพลาด"
        ],
        "technical_details": "เพิ่ม import statement สำหรับ formatDate utility function ใน src/pages/TaskReminder.tsx",
        "impact": "การแสดงผลวันที่ใน Task Reminder จะทำงานได้ถูกต้องและไม่เกิด runtime errors",
        "date": "2025-08-15",
        "time": "14:30:00"
    },
    {
        "id": "log_1755153500000",
        "version": "1.6.2",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลป้ายกำกับตัวกรองช่วงวันที่ใน Dashboard",
        "description": "ปรับปรุงการแสดงผลป้ายกำกับ (labels) ของตัวกรองช่วงวันที่ให้มีความชัดเจนและเป็นระเบียบมากขึ้น โดยเพิ่มป้ายกำกับที่ขาดหายไปและจัดเรียงลำดับให้เป็นไปตามลำดับเวลา",
        "changes": [
            "เพิ่มป้ายกำกับ 'เดือนนี้' สำหรับตัวเลือก thisMonth ที่ขาดหายไป",
            "จัดเรียงลำดับป้ายกำกับให้เป็นไปตามลำดับเวลา: 7 วัน → 30 วัน → เดือนนี้ → เดือนที่แล้ว → ปีนี้ → ปีที่แล้ว",
            "เปลี่ยนป้ายกำกับจาก 'all' เป็น 'สูงสุด' สำหรับการแสดงข้อมูลทั้งหมด",
            "ปรับปรุงการจัดการ default case ให้แสดงผลที่เหมาะสม"
        ],
        "technical_details": "แก้ไขฟังก์ชัน getDateRangeLabel ใน dashboard-filters.tsx โดยเพิ่ม case 'thisMonth' และจัดเรียงลำดับ cases ใหม่ พร้อมเปลี่ยน case 'all' เป็น 'max'",
        "impact": "ผู้ใช้จะเห็นป้ายกำกับที่ชัดเจนและครบถ้วนสำหรับทุกตัวเลือกช่วงวันที่ ทำให้เข้าใจได้ง่ายขึ้นว่าข้อมูลที่แสดงอยู่เป็นช่วงเวลาใด",
        "date": "2025-08-15",
        "time": "14:25:00"
    },
    {
        "id": "log_1755153200000",
        "version": "1.6.1",
        "type": "improvement",
        "title": "ปรับปรุงลำดับและลอจิกตัวกรองช่วงวันที่ใน Dashboard",
        "description": "ปรับปรุงการจัดเรียงและลอจิกการตรวจสอบช่วงวันที่ในตัวกรองข้อมูล Dashboard ให้มีความเป็นระเบียบและทำงานได้แม่นยำมากขึ้น",
        "changes": [
            "เปลี่ยนค่าเริ่มต้นจาก 'all' เป็น 'max' เมื่อไม่มีการกรองวันที่",
            "เพิ่มการตรวจสอบ 'เดือนนี้' (thisMonth) ก่อนเดือนที่แล้ว",
            "จัดเรียงลำดับการตรวจสอบให้เป็นไปตามลำดับเวลา: เดือนนี้ → เดือนที่แล้ว → ปีนี้ → ปีที่แล้ว",
            "ปรับปรุงลอจิกการตรวจสอบช่วงวันที่ให้มีความแม่นยำมากขึ้น"
        ],
        "technical_details": "แก้ไขฟังก์ชัน getDateRangePreset ใน dashboard-filters.tsx โดยเปลี่ยนค่า return จาก 'all' เป็น 'max' และจัดเรียงลำดับการตรวจสอบ date presets ใหม่",
        "impact": "ตัวกรองช่วงวันที่จะทำงานได้แม่นยำและเป็นระเบียบมากขึ้น ผู้ใช้จะได้รับประสบการณ์ที่ดีขึ้นในการเลือกช่วงวันที่สำหรับการกรองข้อมูล",
        "date": "2025-08-15",
        "time": "14:20:00"
    },
    {
        "id": "log_1755152900000",
        "version": "1.6.0",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผล Task Reminder ให้แยกตามสถานะ",
        "description": "ปรับปรุงหน้า Task Reminder ให้มีการจัดกลุ่มและแสดงผล tasks แยกตามสถานะอย่างชัดเจน ทำให้ผู้ใช้สามารถแยกแยะและจัดการ tasks ได้ง่ายขึ้น",
        "changes": [
            "แยกการแสดงผล tasks เป็น 2 กลุ่ม: 'รอทำ' และ 'เรียบร้อยแล้ว'",
            "เพิ่มหัวข้อกลุ่มพร้อมจำนวน tasks ในแต่ละกลุ่ม",
            "เพิ่มสีขอบซ้าย (border-left) เพื่อแยกแยะสถานะ: ส้มสำหรับรอทำ, เขียวสำหรับเสร็จแล้ว",
            "ปรับ opacity ของ tasks ที่เสร็จแล้วให้ดูจางลง (opacity-75)",
            "เพิ่ม line-through และ text-muted-foreground สำหรับชื่อ task ที่เสร็จแล้ว",
            "ปรับ spacing ระหว่างกลุ่มจาก space-y-4 เป็น space-y-6"
        ],
        "technical_details": "แก้ไขโครงสร้าง JSX ใน TaskReminder.tsx โดยแยก tasks ออกเป็น 2 sections ด้วย filter() และเพิ่ม conditional rendering สำหรับแต่ละกลุ่ม พร้อมปรับ CSS classes สำหรับ visual indicators",
        "impact": "ผู้ใช้สามารถมองเห็นและจัดการ tasks ได้ง่ายขึ้น โดยเฉพาะการแยกแยะระหว่าง tasks ที่ยังต้องทำกับที่เสร็จแล้ว ทำให้การใช้งาน Task Reminder มีประสิทธิภาพมากขึ้น",
        "date": "2025-08-15",
        "time": "14:05:00"
    },
    {
        "id": "log_1755152800000",
        "version": "1.5.9",
        "type": "improvement",
        "title": "ปรับปรุงการอ่านข้อมูลค่าคอมมิชชั่นพนักงานจาก Google Sheets",
        "description": "ปรับปรุงการอ่านข้อมูลพนักงานให้สามารถดึงค่าคอมมิชชั่นหน้าร้านและออนไลน์จาก Google Sheets ได้จริง แทนที่จะใช้ค่าเริ่มต้น พร้อมกรองข้อมูลแถวว่างออกเพื่อป้องกันการแสดงผลข้อมูลที่ไม่ถูกต้อง",
        "changes": [
            "เปลี่ยนจากการใช้ค่าเริ่มต้น storeCommission: 2.5, onlineCommission: 3.0 เป็นการอ่านจาก Google Sheets",
            "ใช้ parseFloat(row[8]) และ parseFloat(row[9]) สำหรับอ่านค่าคอมมิชชั่นจริง",
            "เพิ่มการกรองแถวว่าง filter(row => row[0] && row[0].trim() !== '') เพื่อป้องกันข้อมูลเสีย",
            "ตั้งค่า fallback เป็น 0 หากไม่มีข้อมูลคอมมิชชั่น"
        ],
        "technical_details": "แก้ไข parseEmployeeData function ใน src/lib/vercel-employees.ts เพื่อให้อ่านข้อมูลคอมมิชชั่นจาก column H และ I ของ Google Sheets แทนการใช้ hardcoded values",
        "impact": "ข้อมูลค่าคอมมิชชั่นของพนักงานจะแสดงผลตามที่บันทึกไว้ใน Google Sheets จริง ไม่ใช่ค่าเริ่มต้น และไม่มีแถวว่างแสดงในรายชื่อพนักงาน",
        "date": "2025-08-15",
        "time": "14:00:00"
    },
    {
        "id": "log_1755152700000",
        "version": "1.5.8",
        "type": "bugfix",
        "title": "แก้ไขปัญหาการแสดงผลฟิลด์คอมมิชชั่นออนไลน์ในฟอร์มพนักงาน",
        "description": "แก้ไขปัญหาการแสดงผลค่าว่างในฟิลด์คอมมิชชั่นออนไลน์ของฟอร์มเพิ่ม/แก้ไขพนักงาน ตอนนี้จะแสดงค่าว่างแทนที่จะแสดง 0 เมื่อไม่มีข้อมูล และจะตั้งค่าเป็น 0 อัตโนมัติเมื่อผู้ใช้ไม่ได้ใส่ค่า",
        "changes": [
            "เปลี่ยน value จาก formData.onlineCommission เป็น formData.onlineCommission || ''",
            "เปลี่ยน onChange handler ให้ใช้ Number(e.target.value) || 0 แทน Number(e.target.value)",
            "ป้องกันการแสดงผล NaN หรือค่าที่ไม่ถูกต้องในฟิลด์"
        ],
        "technical_details": "แก้ไข input field สำหรับ onlineCommission ใน EmployeeManagement.tsx โดยเพิ่ม fallback values เพื่อจัดการกับค่าว่างและ undefined",
        "impact": "ผู้ใช้จะไม่เห็นค่า 0 ในฟิลด์คอมมิชชั่นออนไลน์เมื่อเปิดฟอร์มใหม่ และการกรอกข้อมูลจะทำงานได้ถูกต้องมากขึ้น",
        "date": "2025-08-14",
        "time": "13:51:40"
    },
    {
        "id": "log_1755152600000",
        "version": "1.5.7",
        "type": "feature",
        "title": "เพิ่มการติดตามยอดขายแยกตามช่องทางในกราฟแนวโน้มรายเดือน",
        "description": "เพิ่มฟีเจอร์การติดตามยอดขายแยกตามช่องทางขาย (หน้าร้าน/ออนไลน์) ในกราฟแนวโน้มรายเดือน ทำให้ผู้ใช้สามารถวิเคราะห์ประสิทธิภาพการขายของแต่ละช่องทางได้อย่างละเอียด",
        "changes": [
            "เพิ่มการคำนวณยอดขายหน้าร้าน (storeIncome) แยกจากยอดขายรวม",
            "เพิ่มการคำนวณยอดขายออนไลน์ (onlineIncome) แยกจากยอดขายรวม",
            "เพิ่มฟิลด์ storeIncome และ onlineIncome ในข้อมูล MonthlyData",
            "เตรียมพื้นฐานสำหรับการแสดงผลเส้นกราฟแยกตามช่องทางขาย"
        ],
        "technical_details": "เพิ่มการคำนวณ monthStoreIncome และ monthOnlineIncome ใน monthly-breakdown-chart.tsx โดยกรองข้อมูลตาม item.channel === 'store' และ 'online' ตามลำดับ",
        "impact": "ผู้ใช้จะสามารถวิเคราะห์และเปรียบเทียบประสิทธิภาพการขายระหว่างช่องทางหน้าร้านและออนไลน์ได้ ช่วยในการวางแผนกลยุทธ์การขายที่เหมาะสม",
        "date": "2025-08-14",
        "time": "13:50:00"
    },
    {
        "id": "log_1755152500000",
        "version": "1.5.6",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลการ์ดกำไรในกราฟแนวโน้มรายเดือนให้รองรับมือถือดีขึ้น",
        "description": "ปรับปรุงการแสดงผลของการ์ดกำไรในกราฟแนวโน้มรายเดือนให้สอดคล้องกับการ์ดอื่นๆ และแสดงผลได้ดีในหน้าจอมือถือมากขึ้น",
        "changes": [
            "ปรับ padding ของการ์ดกำไรให้เป็น responsive: p-2 sm:p-3",
            "เพิ่ม truncate class ให้กับ label เพื่อป้องกันการตัดคำ",
            "เพิ่ม flex-shrink-0 ให้กับจุดสีเพื่อป้องกันการหดตัว",
            "ปรับขนาดตัวอักษรให้ responsive: text-sm sm:text-lg lg:text-xl",
            "เพิ่ม break-all class เพื่อให้ตัวเลขแสดงผลได้ดีในพื้นที่จำกัด"
        ],
        "technical_details": "แก้ไข CSS classes ในการ์ดกำไรของ monthly-breakdown-chart.tsx ให้สอดคล้องกับการ์ดอื่นๆ และรองรับ mobile responsive design",
        "impact": "การ์ดกำไรในกราฟแนวโน้มรายเดือนจะแสดงผลได้ดีและสม่ำเสมอกับการ์ดอื่นๆ ในทุกขนาดหน้าจอ โดยเฉพาะในมือถือ",
        "date": "2025-08-14",
        "time": "13:48:20"
    },
    {
        "id": "log_1755152400000",
        "version": "1.5.5",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลและการใช้งานตัวกรองวันที่ใน Dashboard",
        "description": "เพิ่มการแสดงผลช่วงวันที่ที่เลือกอย่างชัดเจน และปรับปรุงประสบการณ์การใช้งานปฏิทินในตัวกรองวันที่ ทำให้ผู้ใช้เห็นข้อมูลที่เลือกได้ชัดเจนมากขึ้น",
        "changes": [
            "เพิ่มการแสดงผลช่วงวันที่ที่เลือกในกล่องสีฟ้า พร้อมข้อความอธิบาย",
            "แสดงวันที่เริ่มต้นและสิ้นสุดในรูปแบบที่อ่านง่าย",
            "เพิ่มหัวข้อและคำอธิบายในปฏิทินเลือกวันที่",
            "แสดงข้อมูลบริบทในปฏิทิน เช่น 'จะเลือกถึง' หรือ 'เริ่มจาก'",
            "ปรับปรุงการเปลี่ยนไปโหมดกำหนดเองอัตโนมัติเมื่อผู้ใช้เลือกวันที่ด้วยตนเอง",
            "รองรับ Dark Mode ในการแสดงผลช่วงวันที่"
        ],
        "technical_details": "เพิ่ม Date Range Display section และปรับปรุง Calendar PopoverContent ใน dashboard-filters.tsx พร้อมเพิ่ม context headers และ auto-switch logic",
        "impact": "ผู้ใช้สามารถเห็นช่วงวันที่ที่เลือกได้ชัดเจนมากขึ้น และมีประสบการณ์การใช้งานปฏิทินที่ดีขึ้น ลดความสับสนในการเลือกวันที่",
        "date": "2025-08-14",
        "time": "13:46:40"
    },
    {
        "id": "log_1755152100000",
        "version": "1.5.4",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ดตัวกรองข้อมูล Dashboard",
        "description": "ทำความสะอาดและปรับปรุงโครงสร้างโค้ดของคอมโพเนนต์ตัวกรองข้อมูลใน Dashboard ให้มีความเป็นระเบียบมากขึ้น โดยลบฟังก์ชันที่ไม่ได้ใช้งานและปรับปรุงการจัดวาง layout",
        "changes": [
            "ลบฟังก์ชัน updateFilter ที่ไม่ได้ใช้งานออก",
            "ปรับปรุงการจัดวาง (indentation) ของ filters grid ให้เป็นระเบียบ",
            "แก้ไขตำแหน่งของ Active Filters Summary ให้อยู่ในตำแหน่งที่ถูกต้อง",
            "ลบบรรทัดว่างที่ไม่จำเป็นออกจากต้นไฟล์"
        ],
        "technical_details": "Code cleanup ใน src/components/dashboard/dashboard-filters.tsx โดยลบ unused function และปรับปรุง code structure",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดขนาดไฟล์ และง่ายต่อการบำรุงรักษา ไม่มีผลกระทบต่อการใช้งานของผู้ใช้",
        "date": "2025-08-14",
        "time": "13:41:40"
    },
    {
        "id": "log_1755151900000",
        "version": "1.5.3",
        "type": "bugfix",
        "title": "แก้ไขโครงสร้าง HTML ในตัวกรองข้อมูล Dashboard",
        "description": "แก้ไขปัญหาโครงสร้าง HTML ที่ไม่ถูกต้องในคอมโพเนนต์ตัวกรองข้อมูล โดยลบ closing div tag ที่ซ้ำซ้อนออก ทำให้โครงสร้าง HTML มีความถูกต้องและการแสดงผลเป็นไปตามที่ออกแบบไว้",
        "changes": [
            "ลบ closing </div> tag ที่ซ้ำซ้อนในส่วน Active Filters Summary",
            "แก้ไขโครงสร้าง HTML ให้ถูกต้องตามมาตรฐาน",
            "ปรับปรุงการจัดวาง layout ของตัวกรองข้อมูล"
        ],
        "technical_details": "ลบ </div> tag ที่ไม่จำเป็นออกจาก dashboard-filters.tsx ในบรรทัดที่ 488 เพื่อแก้ไขโครงสร้าง HTML ที่ไม่ถูกต้อง",
        "impact": "การแสดงผลตัวกรองข้อมูลใน Dashboard จะมีความถูกต้องมากขึ้น ไม่มีปัญหาเรื่อง layout หรือการจัดวางที่ผิดปกติ",
        "date": "2025-08-14",
        "time": "13:35:00"
    },
    {
        "id": "log_1755151800000",
        "version": "1.5.2",
        "type": "improvement",
        "title": "ปรับปรุงการแสดงผลกราฟแนวโน้มรายเดือนให้รองรับมือถือ",
        "description": "ปรับปรุงการแสดงผลของการ์ดสรุปข้อมูลในกราฟแนวโน้มรายเดือนให้เหมาะสมกับหน้าจอมือถือมากขึ้น โดยลดขนาด padding และปรับขนาดตัวอักษรให้แสดงผลได้ดีในทุกขนาดหน้าจอ",
        "changes": [
            "ปรับ grid layout จาก md:grid-cols-4 เป็น lg:grid-cols-4 เพื่อรองรับหน้าจอขนาดกลาง",
            "ลด padding ของการ์ดจาก p-4 เป็น p-3 และ gap จาก gap-4 เป็น gap-3",
            "ปรับขนาดตัวอักษรให้ responsive: text-xs sm:text-sm สำหรับ label",
            "ปรับขนาดจุดสีให้ responsive: w-2 h-2 sm:w-3 sm:h-3",
            "ปรับขนาดตัวเลขหลักให้ responsive: text-lg sm:text-xl lg:text-2xl",
            "เพิ่ม leading-tight เพื่อลดระยะห่างบรรทัด",
            "ซ่อนข้อความคำแนะนำในหน้าจอเล็ก: hidden sm:block",
            "ปรับข้อความให้สั้นลง: 'คลิกซ่อน'/'คลิกแสดง' แทน 'คลิกเพื่อซ่อน'/'คลิกเพื่อแสดง'"
        ],
        "technical_details": "ปรับปรุง CSS classes ใน monthly-breakdown-chart.tsx สำหรับ responsive design และ mobile optimization",
        "impact": "ผู้ใช้มือถือสามารถดูและใช้งานกราฟแนวโน้มรายเดือนได้สะดวกมากขึ้น การแสดงผลเหมาะสมกับหน้าจอขนาดเล็ก",
        "date": "2025-08-14",
        "time": "13:30:00"
    },
    {
        "id": "log_1755151750000",
        "version": "1.5.1",
        "type": "improvement",
        "title": "เตรียมเพิ่มฟีเจอร์ Collapsible ในตัวกรองข้อมูล Dashboard",
        "description": "ทำความสะอาดโค้ดและเตรียมพื้นฐานสำหรับการเพิ่มฟีเจอร์ Collapsible ในส่วนตัวกรองข้อมูลของ Dashboard ทำให้ผู้ใช้สามารถซ่อน/แสดงตัวกรองได้ตามต้องการ เพื่อประหยัดพื้นที่หน้าจอ",
        "changes": [
            "ลบ import ที่ไม่ได้ใช้งาน: CardContent, CardHeader, CardTitle, cn utility",
            "เพิ่ม import สำหรับ Collapsible components: Collapsible, CollapsibleContent, CollapsibleTrigger",
            "เพิ่มไอคอน ChevronDown และ ChevronUp สำหรับปุ่มแสดง/ซ่อน",
            "เตรียมพื้นฐานสำหรับฟีเจอร์ Collapsible filters"
        ],
        "technical_details": "ปรับปรุง imports ใน src/components/dashboard/dashboard-filters.tsx โดยลบ unused imports และเพิ่ม Collapsible components พร้อม chevron icons",
        "impact": "เตรียมพื้นฐานสำหรับการปรับปรุง UX ของตัวกรองข้อมูล ผู้ใช้จะสามารถซ่อน/แสดงตัวกรองได้ในอนาคต ทำให้การใช้งานมีความยืดหยุ่นมากขึ้น",
        "date": "2025-08-14",
        "time": "13:29:10"
    },
    {
        "id": "log_1755151700000",
        "version": "1.5.0",
        "type": "improvement",
        "title": "ปรับปรุงเป้าหมายยอดขายเริ่มต้นในการตั้งค่า",
        "description": "เพิ่มเป้าหมายยอดขายเริ่มต้นจาก 15,000 บาท เป็น 200,000 บาท ให้สอดคล้องกับเป้าหมายรายเดือน ทำให้การตั้งค่าเริ่มต้นมีความเหมาะสมมากขึ้นสำหรับธุรกิจขนาดกลาง",
        "changes": [
            "เปลี่ยนค่าเริ่มต้นของ defaultSalesTarget จาก 15,000 เป็น 200,000 บาท",
            "ทำให้เป้าหมายยอดขายเริ่มต้นสอดคล้องกับเป้าหมายรายเดือน",
            "ปรับปรุงการตั้งค่าเริ่มต้นให้เหมาะสมกับธุรกิจขนาดกลาง"
        ],
        "technical_details": "แก้ไขค่า defaultSalesTarget ใน handleResetSettings function ใน src/pages/AppSettings.tsx จาก 15000 เป็น 200000",
        "impact": "ผู้ใช้ที่รีเซ็ตการตั้งค่าจะได้เป้าหมายยอดขายที่เหมาะสมมากขึ้น ไม่ต้องปรับแต่งเพิ่มเติม",
        "date": "2025-08-14",
        "time": "13:25:00"
    },
    {
        "id": "log_1755151600000",
        "version": "1.4.9",
        "type": "improvement",
        "title": "เตรียมการเชื่อมต่อระบบการตั้งค่ากับหน้า Dashboard",
        "description": "เพิ่มการเชื่อมต่อ useSettings hook ในหน้า Dashboard หลัก เพื่อเตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในการแสดงผลและปรับแต่งฟีเจอร์ต่างๆ ของ Dashboard",
        "changes": [
            "เพิ่ม import useSettings hook ในหน้า Dashboard (Index.tsx)",
            "เตรียมพื้นฐานสำหรับการใช้งานข้อมูลการตั้งค่าในอนาคต",
            "รองรับการปรับแต่งการแสดงผลตามการตั้งค่าของผู้ใช้"
        ],
        "technical_details": "เพิ่ม import { useSettings } from '@/hooks/use-settings' ใน src/pages/Index.tsx",
        "impact": "เตรียมพื้นฐานสำหรับฟีเจอร์การปรับแต่ง Dashboard ตามการตั้งค่าของผู้ใช้ เช่น สี ธีม และตัวเลือกต่างๆ",
        "date": "2025-08-14",
        "time": "13:20:00"
    },
    {
        "id": "log_1755151500000",
        "version": "1.4.8",
        "type": "improvement",
        "title": "เพิ่มฟิลด์เป้าหมายรายเดือนในระบบการตั้งค่า",
        "description": "เพิ่มฟิลด์ monthlyTarget ในโครงสร้างการตั้งค่าระบบ เพื่อรองรับการตั้งเป้าหมายยอดขายรายเดือนแยกจากเป้าหมายยอดขายเริ่มต้น ทำให้ผู้ใช้สามารถกำหนดเป้าหมายรายเดือนได้อย่างยืดหยุ่นมากขึ้น",
        "changes": [
            "เพิ่มฟิลด์ monthlyTarget ในอินเทอร์เฟซ AppSettings",
            "รองรับการตั้งค่าเป้าหมายยอดขายรายเดือนแยกจากเป้าหมายเริ่มต้น",
            "เตรียมพื้นฐานสำหรับฟีเจอร์การติดตามเป้าหมายรายเดือน"
        ],
        "technical_details": "เพิ่มฟิลด์ monthlyTarget: number ในอินเทอร์เฟซ AppSettings ใน src/types/settings.ts",
        "impact": "ผู้ใช้จะสามารถตั้งเป้าหมายยอดขายรายเดือนได้อย่างแยกจากเป้าหมายเริ่มต้น ทำให้การติดตามประสิทธิภาพการขายมีความแม่นยำมากขึ้น",
        "date": "2025-08-14",
        "time": "13:15:00"
    },
    {
        "id": "log_1755151400000",
        "version": "1.4.7",
        "type": "improvement",
        "title": "เพิ่มตัวบ่งชี้การกรองข้อมูลในการ์ดเป้าหมายการขาย",
        "description": "เพิ่มการแสดงคำเตือนในการ์ดเป้าหมายการขายเมื่อมีการใช้ตัวกรองข้อมูล เพื่อให้ผู้ใช้ทราบว่ายอดขายที่แสดงเป็นข้อมูลที่ถูกกรองแล้ว ไม่ใช่ยอดขายทั้งหมด",
        "changes": [
            "เพิ่มไอคอนเตือนและข้อความ 'ข้อมูลถูกกรองแล้ว' ในการ์ดยอดขาย",
            "แสดงคำเตือนเมื่อมีการใช้ตัวกรองใดๆ (วันที่, ช่องทาง, สาขา, หมวดหมู่, ค้นหา)",
            "ใช้สีเหลือง/ส้มเพื่อเน้นการแจ้งเตือน",
            "รองรับ Dark Mode ในการแสดงผลคำเตือน"
        ],
        "technical_details": "เพิ่ม conditional rendering ใน sales-target.tsx ที่ตรวจสอบ filters object และแสดงคำเตือนเมื่อมีการใช้ตัวกรองใดๆ",
        "impact": "ผู้ใช้จะไม่เข้าใจผิดเกี่ยวกับยอดขายที่แสดงในการ์ดเป้าหมาย และทราบได้ชัดเจนว่าข้อมูลถูกกรองแล้ว",
        "date": "2025-08-14",
        "time": "13:10:00"
    },
    {
        "id": "log_1755151300000",
        "version": "1.4.6",
        "type": "improvement",
        "title": "ปรับปรุงการจัดการโหมดกำหนดเองในตัวกรองวันที่",
        "description": "ปรับปรุงลอจิกการจัดการโหมดกำหนดเองในตัวกรองช่วงวันที่ให้ทำงานได้ราบรื่นมากขึ้น โดยเพิ่มคำอธิบายที่ชัดเจนและปรับปรุงการแสดงผล date pickers เมื่อผู้ใช้เลือกโหมดกำหนดเอง",
        "changes": [
            "เพิ่มคำอธิบายที่ชัดเจนในโค้ดสำหรับการจัดการโหมดกำหนดเอง",
            "ปรับปรุงลอจิกการแสดงผล date pickers ให้เหมาะสมมากขึ้น",
            "เพิ่มการจัดการกรณีที่ผู้ใช้เปลี่ยนไปโหมดกำหนดเองโดยไม่มีวันที่เริ่มต้น"
        ],
        "technical_details": "ปรับปรุงฟังก์ชัน handleDateRangePreset ใน dashboard-filters.tsx เพิ่มคำอธิบายและปรับปรุงการจัดการ case 'custom'",
        "impact": "ผู้ใช้จะได้รับประสบการณ์ที่ดีขึ้นเมื่อใช้งานตัวกรองวันที่แบบกำหนดเอง โดยระบบจะแสดง date pickers อย่างเหมาะสม",
        "date": "2025-08-14",
        "time": "13:05:00"
    },
    {
        "id": "log_1755151200000",
        "version": "1.4.5",
        "type": "improvement",
        "title": "ปรับปรุงการจัดรูปแบบโค้ดในไฟล์ Settings Types",
        "description": "ทำความสะอาดโค้ดในไฟล์ src/types/settings.ts โดยลบช่องว่างที่ไม่จำเป็นออก ทำให้โค้ดมีความเป็นระเบียบมากขึ้น",
        "changes": [
            "ลบ trailing whitespace ออกจากไฟล์ settings.ts",
            "ปรับปรุงการจัดรูปแบบโค้ดให้สม่ำเสมอ",
            "ไม่มีการเปลี่ยนแปลงฟังก์ชันการทำงาน"
        ],
        "technical_details": "Code formatting cleanup - removed trailing whitespace from multiple lines in src/types/settings.ts",
        "impact": "ไม่มีผลกระทบต่อการใช้งาน เป็นการปรับปรุงคุณภาพโค้ดเท่านั้น",
        "date": "2025-08-14",
        "time": "13:00:00"
    },
    {
        "id": "log_1755150900000",
        "version": "1.4.4",
        "type": "improvement",
        "title": "ปรับปรุงฟิลด์สาขา/แพลตฟอร์มใน Task Reminder ให้ใช้ Dropdown",
        "description": "เปลี่ยนฟิลด์สาขา/แพลตฟอร์มใน Task Reminder จากการพิมพ์อิสระเป็น Dropdown ที่เชื่อมต่อกับการตั้งค่าระบบ ทำให้การเลือกสาขา/แพลตฟอร์มมีความสม่ำเสมอและถูกต้องมากขึ้น",
        "changes": [
            "เปลี่ยนจาก Input field เป็น Select dropdown สำหรับฟิลด์สาขา/แพลตฟอร์ม",
            "เชื่อมต่อกับการตั้งค่า branches จากระบบ Settings",
            "แสดงตัวเลือกสาขา/แพลตฟอร์มที่ผู้ใช้กำหนดไว้ในการตั้งค่า",
            "ใช้ค่าเริ่มต้น 'สาขาหลัก' หากยังไม่มีการตั้งค่า"
        ],
        "technical_details": "เปลี่ยน Input component เป็น Select component ใน TaskReminder.tsx และเชื่อมต่อกับ settings.branches จาก useSettings hook",
        "impact": "ผู้ใช้สามารถเลือกสาขา/แพลตฟอร์มได้อย่างสม่ำเสมอ ลดข้อผิดพลาดจากการพิมพ์ผิด และทำให้ข้อมูลมีความถูกต้องมากขึ้น",
        "date": "2025-08-14",
        "time": "12:55:00"
    },
    {
        "id": "log_1755150800000",
        "version": "1.4.3",
        "type": "feature",
        "title": "เพิ่มฟังก์ชันจัดการตัวเลือกในหน้าการตั้งค่า",
        "description": "เพิ่มฟังก์ชันสำหรับจัดการตัวเลือกต่างๆ ในหน้าการตั้งค่า ทำให้ผู้ใช้สามารถเพิ่ม ลบ และจัดการตัวเลือกช่องทางขาย สาขา/แพลตฟอร์ม หมวดหมู่สินค้า และหมวดหมู่รายจ่ายได้ด้วยตนเอง พร้อมเพิ่มค่าเริ่มต้นในการรีเซ็ตการตั้งค่า",
        "changes": [
            "เพิ่มฟังก์ชัน addChannel และ removeChannel สำหรับจัดการช่องทางขาย",
            "เพิ่มฟังก์ชัน addBranch และ removeBranch สำหรับจัดการสาขา/แพลตฟอร์ม",
            "เพิ่มฟังก์ชัน addProductCategory และ removeProductCategory สำหรับจัดการหมวดหมู่สินค้า",
            "เพิ่มฟังก์ชัน addExpenseCategory และ removeExpenseCategory สำหรับจัดการหมวดหมู่รายจ่าย",
            "เพิ่มค่าเริ่มต้นสำหรับตัวเลือกต่างๆ ในฟังก์ชัน handleResetSettings"
        ],
        "technical_details": "เพิ่มฟังก์ชันจัดการ state สำหรับ channels, branches, productCategories, expenseCategories ใน AppSettings.tsx และปรับปรุง handleResetSettings ให้รวมค่าเริ่มต้นของตัวเลือกต่างๆ",
        "impact": "ผู้ใช้สามารถปรับแต่งตัวเลือกในระบบได้ตามความต้องการ ทำให้ระบบมีความยืดหยุ่นมากขึ้นและสามารถใช้งานได้กับธุรกิจที่หลากหลาย",
        "date": "2025-08-14",
        "time": "12:50:00"
    },
    {
        "id": "log_1755150700000",
        "version": "1.4.2",
        "type": "improvement",
        "title": "เพิ่มฟิลด์การตั้งค่าตัวเลือกในระบบ Settings",
        "description": "เพิ่มฟิลด์ใหม่ในโครงสร้างการตั้งค่าระบบเพื่อรองรับการจัดการตัวเลือกต่างๆ ที่ใช้ในฟอร์มบันทึกข้อมูล ทำให้ผู้ใช้สามารถปรับแต่งตัวเลือกช่องทางขาย สาขา/แพลตฟอร์ม และหมวดหมู่ต่างๆ ได้ตามความต้องการ",
        "changes": [
            "เพิ่มฟิลด์ channels สำหรับจัดการตัวเลือกช่องทางขาย",
            "เพิ่มฟิลด์ branches สำหรับจัดการตัวเลือกสาขา/แพลตฟอร์ม",
            "เพิ่มฟิลด์ productCategories สำหรับจัดการหมวดหมู่สินค้า",
            "เพิ่มฟิลด์ expenseCategories สำหรับจัดการหมวดหมู่รายจ่าย"
        ],
        "technical_details": "เพิ่มฟิลด์ channels, branches, productCategories, expenseCategories ในอินเทอร์เฟซ AppSettings ใน src/types/settings.ts",
        "impact": "เตรียมพื้นฐานสำหรับการพัฒนาระบบการตั้งค่าที่ให้ผู้ใช้สามารถปรับแต่งตัวเลือกในฟอร์มได้เอง แทนที่จะใช้ค่าคงที่",
        "date": "2025-08-14",
        "time": "12:45:00"
    },
    {
        "id": "log_1755150600000",
        "version": "1.4.1",
        "type": "improvement",
        "title": "ปรับปรุงขนาดหน้าต่างเพิ่ม Task ใน Task Reminder",
        "description": "ปรับปรุงหน้าต่างเพิ่ม Task ใหม่ให้มีขนาดใหญ่ขึ้นและสามารถเลื่อนดูได้ เพื่อรองรับฟิลด์ข้อมูลที่เพิ่มขึ้นและให้ผู้ใช้สามารถกรอกข้อมูลได้สะดวกมากขึ้น",
        "changes": [
            "เปลี่ยนขนาดหน้าต่างจาก max-w-md เป็น max-w-lg",
            "เพิ่มการจำกัดความสูงสูงสุดที่ 90vh",
            "เพิ่มการเลื่อนดูแนวตั้งเมื่อเนื้อหาเกินขนาดหน้าจอ"
        ],
        "technical_details": "เปลี่ยน DialogContent className จาก 'max-w-md' เป็น 'max-w-lg max-h-[90vh] overflow-y-auto' ใน TaskReminder.tsx",
        "impact": "ผู้ใช้สามารถเห็นและกรอกข้อมูลในฟอร์มเพิ่ม Task ได้สะดวกมากขึ้น โดยเฉพาะในหน้าจอขนาดเล็กหรือเมื่อมีฟิลด์ข้อมูลจำนวนมาก",
        "date": "2025-08-14",
        "time": "12:40:00"
    },
    {
        "id": "log_1755150500000",
        "version": "1.4.0",
        "type": "feature",
        "title": "เพิ่มฟังก์ชันสำหรับแปลงข้อมูลจาก Task Reminder เป็นรายการรายรับ-รายจ่าย",
        "description": "เพิ่มฟังก์ชัน createIncomeRecord และ createExpenseRecord ใน vercel-sheets.ts เพื่อรองรับการแปลงข้อมูลจาก Task Reminder ให้เป็นรูปแบบมาตรฐานของรายการรายรับและรายจ่าย ทำให้การบันทึกข้อมูลจาก Task Reminder มีความสะดวกและแม่นยำมากขึ้น",
        "changes": [
            "เพิ่มฟังก์ชัน createIncomeRecord สำหรับแปลงข้อมูลรายรับจาก Task Reminder",
            "เพิ่มฟังก์ชัน createExpenseRecord สำหรับแปลงข้อมูลรายจ่ายจาก Task Reminder",
            "รองรับการแปลงฟิลด์ต่างๆ เช่น product_name, expense_item, channel, branch_or_platform",
            "ตั้งค่าค่าเริ่มต้นสำหรับฟิลด์ที่ไม่ได้ระบุ เช่น quantity = 1, channel = 'store'",
            "เชื่อมต่อกับฟังก์ชัน addIncomeRecord และ addExpenseRecord ที่มีอยู่แล้ว"
        ],
        "technical_details": "เพิ่มฟังก์ชัน createIncomeRecord และ createExpenseRecord ใน src/lib/vercel-sheets.ts ที่รับข้อมูลในรูปแบบ Task Reminder และแปลงเป็นรูปแบบมาตรฐานก่อนส่งไปยัง addIncomeRecord/addExpenseRecord",
        "impact": "ผู้ใช้สามารถบันทึกข้อมูลจาก Task Reminder ได้อย่างสะดวกและแม่นยำมากขึ้น โดยระบบจะจัดการการแปลงรูปแบบข้อมูลให้อัตโนมัติ",
        "date": "2025-08-14",
        "time": "12:35:00"
    },
    {
        "id": "log_1755150400000",
        "version": "1.3.9",
        "type": "improvement",
        "title": "ปรับปรุงหน้าต่างยืนยันการบันทึกใน Task Reminder",
        "description": "ปรับปรุงหน้าต่างยืนยันการบันทึกใน Task Reminder ให้รองรับทั้งรายรับและรายจ่าย พร้อมแสดงข้อมูลครบถ้วนก่อนการบันทึก ทำให้ผู้ใช้เห็นรายละเอียดที่จะถูกบันทึกอย่างชัดเจน",
        "changes": [
            "เปลี่ยนชื่อหน้าต่างจาก 'บันทึกรายจ่าย' เป็น 'บันทึกรายรับ/รายจ่าย' ตามประเภท task",
            "แสดงข้อมูลช่องทางขาย (หน้าร้าน/ออนไลน์) ในหน้าต่างยืนยัน",
            "แสดงข้อมูลสาขา/แพลตฟอร์มในหน้าต่างยืนยัน",
            "แสดงหมวดหมู่สินค้าสำหรับ task ประเภทรายรับ",
            "แสดงหมวดหมู่รายจ่ายสำหรับ task ประเภทรายจ่าย",
            "ปรับสีปุ่มยืนยันให้เหมาะสมกับประเภท (เขียวสำหรับรายรับ, ส้มสำหรับรายจ่าย)"
        ],
        "technical_details": "ปรับปรุง AlertDialog ใน TaskReminder.tsx เพิ่มการแสดงผล channel, branchOrPlatform, productCategory, expenseCategory และปรับ conditional styling สำหรับปุ่มยืนยัน",
        "impact": "ผู้ใช้สามารถตรวจสอบข้อมูลที่จะถูกบันทึกได้อย่างครบถ้วนก่อนการยืนยัน ลดความผิดพลาดในการบันทึกข้อมูล",
        "date": "2025-08-14",
        "time": "12:30:00"
    },
    {
        "id": "log_1755150100000",
        "version": "1.3.8",
        "type": "feature",
        "title": "เสร็จสิ้นการพัฒนาฟอร์ม Task Reminder แบบครบถ้วน",
        "description": "ดำเนินการเพิ่มฟิลด์ข้อมูลเพิ่มเติมในฟอร์ม Task Reminder ให้เสร็จสมบูรณ์ ตอนนี้ผู้ใช้สามารถระบุข้อมูลครบถ้วนสำหรับการสร้าง task ที่สามารถแปลงเป็นรายการรายรับ-รายจ่ายได้อย่างสมบูรณ์",
        "changes": [
            "เพิ่มฟิลด์ 'ช่องทางขาย' ให้เลือกระหว่างหน้าร้านและออนไลน์",
            "เพิ่มฟิลด์ 'สาขา/แพลตฟอร์ม' พร้อม placeholder ที่เปลี่ยนตามช่องทางที่เลือก",
            "เพิ่มฟิลด์ 'หมวดหมู่สินค้า' สำหรับ task ประเภทรายรับ",
            "เพิ่มฟิลด์ 'หมวดหมู่รายจ่าย' สำหรับ task ประเภทรายจ่าย",
            "ปรับปรุงการตรวจสอบข้อมูลให้ครอบคลุมฟิลด์ใหม่ทั้งหมด"
        ],
        "technical_details": "เพิ่ม UI components สำหรับ channel, branchOrPlatform, productCategory, และ expenseCategory ใน TaskReminder.tsx พร้อมการตรวจสอบข้อมูลแบบ conditional",
        "impact": "ผู้ใช้สามารถสร้าง Task Reminder ที่มีข้อมูลครบถ้วนและสามารถแปลงเป็นรายการรายรับ-รายจ่ายจริงได้อย่างแม่นยำ ลดขั้นตอนการกรอกข้อมูลซ้ำ",
        "date": "2025-08-14",
        "time": "12:25:00"
    },
    {
        "id": "log_1755149800000",
        "version": "1.3.7",
        "type": "improvement",
        "title": "ปรับปรุงฟอร์มข้อมูลใน Task Reminder",
        "description": "เพิ่มฟิลด์ข้อมูลเพิ่มเติมในฟอร์ม Task Reminder เพื่อรองรับการบันทึกข้อมูลที่สมบูรณ์มากขึ้น รวมถึงหมวดหมู่สินค้า หมวดหมู่ค่าใช้จ่าย ช่องทางขาย และสาขา/แพลตฟอร์ม",
        "changes": [
            "เพิ่มฟิลด์ productCategory สำหรับหมวดหมู่สินค้า",
            "เพิ่มฟิลด์ expenseCategory สำหรับหมวดหมู่ค่าใช้จ่าย", 
            "เพิ่มฟิลด์ channel สำหรับระบุช่องทางขาย (หน้าร้าน/ออนไลน์)",
            "เพิ่มฟิลด์ branchOrPlatform สำหรับระบุสาขาหรือแพลตฟอร์ม",
            "ปรับปรุงโครงสร้างข้อมูลให้สอดคล้องกับระบบบันทึกรายรับ-รายจ่าย"
        ],
        "technical_details": "เพิ่มฟิลด์ productCategory, expenseCategory, channel, branchOrPlatform ใน formData state ของ TaskReminder.tsx",
        "impact": "ผู้ใช้สามารถบันทึก Task Reminder ที่มีข้อมูลครบถ้วนมากขึ้น ทำให้การแปลงเป็นรายการรายรับ-รายจ่ายจริงมีความแม่นยำและสมบูรณ์",
        "date": "2025-08-14",
        "time": "12:20:00"
    },
    {
        "id": "log_1755149700000",
        "version": "1.3.6",
        "type": "improvement",
        "title": "ปรับปรุงตัวกรองสาขา/แพลตฟอร์มใน Dashboard",
        "description": "แก้ไขปัญหาการแสดงผลตัวเลือกสาขา/แพลตฟอร์มที่เป็นค่าว่างในระบบตัวกรอง โดยเพิ่มการกรองข้อมูลให้แสดงเฉพาะสาขาที่มีชื่อจริง",
        "changes": [
            "เพิ่มการกรองข้อมูลสาขา/แพลตฟอร์มที่เป็นค่าว่างออกจาก dropdown",
            "ปรับปรุงการแสดงผลให้แสดงเฉพาะตัวเลือกที่มีข้อมูลจริง",
            "ลดความสับสนในการเลือกตัวกรองสำหรับผู้ใช้"
        ],
        "technical_details": "เพิ่ม .filter(branch => branch && branch.trim() !== '') ใน availableBranches.map() ใน dashboard-filters.tsx",
        "impact": "ผู้ใช้จะเห็นเฉพาะตัวเลือกสาขา/แพลตฟอร์มที่มีข้อมูลจริง ทำให้การใช้งานตัวกรองมีประสิทธิภาพมากขึ้น",
        "date": "2025-08-14",
        "time": "12:15:00"
    },
    {
        "id": "log_1755149400000",
        "version": "1.3.5",
        "type": "improvement",
        "title": "ปรับปรุงโค้ดและการแสดงผลกราฟแนวโน้มรายเดือน",
        "description": "ทำความสะอาดโค้ดในคอมโพเนนต์กราฟแนวโน้มรายเดือน โดยลบ import ที่ไม่ได้ใช้งาน ปรับปรุงการจัดรูปแบบโค้ด และเพิ่มการรองรับ Dark Mode ให้ดีขึ้น",
        "changes": [
            "ลบ import Legend และ TrendingUp ที่ไม่ได้ใช้งานออก",
            "ลบ import subMonths ที่ไม่จำเป็นออก",
            "ปรับปรุงการจัดรูปแบบโค้ดให้เป็นระเบียบมากขึ้น",
            "เพิ่มการรองรับ Dark Mode ในการ์ดสรุปข้อมูล",
            "ปรับขนาดตัวอักษรในการ์ดสรุปจาก text-xl เป็น text-2xl",
            "ปรับสีและความโปร่งใสของการ์ดให้เหมาะสมกับ Dark Mode"
        ],
        "technical_details": "ลบ unused imports (Legend, TrendingUp, subMonths), ปรับปรุง CSS classes สำหรับ dark mode support, เปลี่ยน text-xl เป็น text-2xl ในการ์ดสรุป, ปรับ background opacity และ border colors",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดขนาดไฟล์ และการแสดงผลใน Dark Mode ดูสวยงามและอ่านง่ายขึ้น",
        "date": "2025-08-14",
        "time": "12:10:00"
    },
    {
        "id": "log_1755149100000",
        "version": "1.3.4",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ดหน้า Dashboard หลัก",
        "description": "ทำความสะอาดโค้ดในหน้า Dashboard หลัก โดยลบ import ที่ไม่ได้ใช้งานออก เพื่อให้โค้ดมีความเป็นระเบียบและลดขนาดไฟล์",
        "changes": [
            "ลบ import SummaryCards ที่ไม่ได้ใช้งานออกจาก Index.tsx",
            "ปรับปรุงโครงสร้าง import statements ให้เป็นระเบียบ",
            "ลดขนาดไฟล์และปรับปรุงประสิทธิภาพการโหลด"
        ],
        "technical_details": "ลบ import { SummaryCards } from '@/components/dashboard/summary-cards' ออกจาก src/pages/Index.tsx",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดขนาดไฟล์ และปรับปรุงประสิทธิภาพการโหลดหน้าเว็บ",
        "date": "2025-08-14",
        "time": "12:05:00"
    },
    {
        "id": "log_1755148800000",
        "version": "1.3.3",
        "type": "improvement",
        "title": "เตรียมปรับปรุง UI ของหน้า Task Reminder",
        "description": "เพิ่ม UI components ใหม่สำหรับปรับปรุงประสบการณ์การใช้งานในหน้า Task Reminder โดยเพิ่ม AlertDialog สำหรับการยืนยันการดำเนินการ และ DialogDescription สำหรับคำอธิบายที่ชัดเจนขึ้น",
        "changes": [
            "เพิ่ม AlertDialog components สำหรับการยืนยันการลบหรือแก้ไข task",
            "เพิ่ม DialogDescription สำหรับคำอธิบายที่ชัดเจนในฟอร์ม",
            "เพิ่ม Receipt icon สำหรับแสดงผลที่เกี่ยวข้องกับการเงิน",
            "ปรับปรุง import statements ให้รองรับ UI components ใหม่"
        ],
        "technical_details": "เพิ่ม import สำหรับ DialogDescription, AlertDialog และ components ที่เกี่ยวข้อง, เพิ่ม Receipt icon จาก lucide-react ใน src/pages/TaskReminder.tsx",
        "impact": "เตรียมพื้นฐานสำหรับการปรับปรุง UX ในการจัดการ task reminders ให้มีการยืนยันและคำอธิบายที่ชัดเจนขึ้น",
        "date": "2025-08-14",
        "time": "12:00:00"
    },
    {
        "id": "log_1755148500000",
        "version": "1.3.2",
        "type": "improvement",
        "title": "ปรับปรุง UI ของกราฟแนวโน้มรายเดือน",
        "description": "เปลี่ยนแปลงการแสดงผลของกราฟแนวโน้มรายเดือนให้ดูสวยงามและใช้งานง่ายขึ้น โดยรวมการควบคุมการแสดงผลเส้นกราฟเข้ากับการแสดงสรุปยอดรวม ทำให้ผู้ใช้สามารถดูข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว",
        "changes": [
            "เปลี่ยนปุ่มควบคุมเส้นกราฟเป็นการ์ดแบบ Interactive",
            "แสดงยอดรวมของแต่ละหมวดหมู่ในการ์ดควบคุม",
            "เพิ่ม Visual feedback เมื่อ hover และ click",
            "ปรับปรุงการจัดวางให้ดูเป็นระเบียบมากขึ้น",
            "เพิ่มสีสันและ Animation ให้ดูทันสมัย"
        ],
        "technical_details": "แทนที่ Button controls ด้วย clickable cards ที่แสดงทั้งข้อมูลสรุปและทำหน้าที่ควบคุมการแสดงผลเส้นกราฟ พร้อม responsive design และ dark mode support",
        "impact": "ผู้ใช้สามารถเห็นข้อมูลสรุปและควบคุมกราฟได้ในที่เดียว ทำให้ประสบการณ์การใช้งานดีขึ้นและประหยัดพื้นที่หน้าจอ",
        "date": "2025-08-14",
        "time": "11:55:00"
    },
    {
        "id": "log_1755148200000",
        "version": "1.3.1",
        "type": "improvement",
        "title": "ปรับปรุงโครงสร้างโค้ด Update Logs Hook",
        "description": "ปรับปรุงการจัดการ API calls ใน use-logs hook โดยย้าย API functions มาอยู่ภายในไฟล์เดียวกัน เพื่อให้โค้ดมีความเป็นระเบียบมากขึ้นและลดการ dependency",
        "changes": [
            "ย้าย API functions จาก vercel-logs.ts มาอยู่ใน use-logs.ts",
            "ลด import dependencies ที่ไม่จำเป็น",
            "ปรับปรุงโครงสร้างโค้ดให้เป็นระเบียบมากขึ้น",
            "รักษาฟังก์ชันการทำงานเดิมไว้ครบถ้วน"
        ],
        "technical_details": "Refactored use-logs.ts to include API functions locally instead of importing from vercel-logs.ts",
        "impact": "โค้ดมีความเป็นระเบียบมากขึ้น ลดความซับซ้อนในการจัดการไฟล์",
        "date": "2025-08-14",
        "time": "11:50:00"
    },
    {
        "id": "log_1755147906543",
        "version": "1.3.0",
        "type": "improvement",
        "title": "ปรับปรุงระบบตัวกรองข้อมูลใน Dashboard",
        "description": "เปลี่ยนแปลงการแสดงผลตัวกรองจากแบบ Popup เป็นแบบ Grid Layout ที่แสดงผลแบบเต็มหน้า พร้อมเพิ่มฟีเจอร์ค้นหาและแสดงสถานะตัวกรองที่ใช้งานอยู่อย่างชัดเจน ทำให้ผู้ใช้สามารถเข้าถึงและจัดการตัวกรองได้ง่ายขึ้น",
        "changes": [
            "UI Layout: เปลี่ยนจาก Popover เป็น Grid Layout แบบเต็มหน้า",
            "Search Feature: เพิ่มช่องค้นหาสำหรับชื่อสินค้าและหมายเหตุ",
            "Active Filters Display: แสดงตัวกรองที่ใช้งานอยู่พร้อมปุ่มลบแต่ละตัว",
            "Better UX: ปรับปรุงการใช้งานให้เข้าถึงได้ง่ายขึ้น",
            "Responsive Design: รองรับการแสดงผลในหน้าจอขนาดต่างๆ"
        ],
        "technical_details": "ไฟล์ที่แก้ไข: src/components/dashboard/dashboard-filters.tsx, เพิ่ม Search icon import จาก lucide-react, เปลี่ยนโครงสร้าง UI จาก Popover เป็น Grid Cards, เพิ่มฟีเจอร์ Active Filters Summary",
        "impact": "ผู้ใช้สามารถเห็นและจัดการตัวกรองได้ง่ายขึ้น, ประสบการณ์การใช้งานดีขึ้น, การค้นหาข้อมูลสะดวกมากขึ้น",
        "date": "2025-08-14",
        "time": "11:41:52"
    },
    {
        "id": "log_1755147800000",
        "version": "1.2.0",
        "type": "feature",
        "title": "เพิ่มระบบตัวกรองข้วงวันที่แบบครอบคลุม",
        "description": "เพิ่มตัวเลือกช่วงวันที่ที่หลากหลาย รวมถึง 7 วัน, 30 วัน, เดือนที่แล้ว, ปีที่แล้ว, ปีนี้, ทั้งหมด และกำหนดเอง พร้อมปฏิทินสำหรับเลือกวันที่",
        "changes": [
            "เพิ่มตัวเลือกช่วงวันที่ 7 วันที่ผ่านมา",
            "เพิ่มตัวเลือกช่วงวันที่ 30 วันที่ผ่านมา",
            "เพิ่มตัวเลือกเดือนที่แล้ว",
            "เพิ่มตัวเลือกปีที่แล้ว",
            "เพิ่มตัวเลือกปีนี้",
            "เพิ่มตัวเลือกทั้งหมด",
            "เพิ่มตัวเลือกกำหนดเองพร้อมปฏิทิน"
        ],
        "technical_details": "ปรับปรุง dashboard-filters.tsx เพิ่มฟังก์ชัน getDateRangePreset และ handleDateRangePreset",
        "impact": "ผู้ใช้สามารถกรองข้อมูลตามช่วงเวลาได้อย่างยืดหยุ่นมากขึ้น",
        "date": "2025-08-14",
        "time": "10:30:00"
    }
]